[
  {
    "title": "Lifecycle Marketing Manager",
    "company_name": "Propel",
    "company_stage": "Growth",
    "location": "Brooklyn, US Remote",
    "industry": "American Dynamism, Fintech",
    "category": "Marketing",
    "experience_level": "Senior",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$120,000 - $135,000",
    "description_url": "https://job-boards.greenhouse.io/propel/jobs/8366614002",
    "required_skills": [
      "CRM",
      "Lifecycle Marketing",
      "Personalization",
      "Artificial Intelligence",
      "Product Marketing",
      "Inform",
      "CSS",
      "Retargeting",
      "Finance",
      "Braze",
      "Mobile Programming",
      "Quality Assurance",
      "Marketplace",
      "Onboarding"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Job Application for Lifecycle Marketing Manager at Propel\nBack to jobs\nNew\nLifecycle Marketing Manager\nBrooklyn or US Remote\nAbout Us\nPropel is on a mission to build technology that strengthens the social safety net. We’re a passionate team of ~100 Propellers who envision a future where every American has the tools and resources they need to thrive.\nThe Role\nLifecycle marketing is at an exciting inflection point. We’ve laid the groundwork with early wins in driving revenue growth and retention, but we’re still in the early stages of building a scaled lifecycle marketing program. This role provides a unique opportunity to drive a disproportionate impact on a business that is keenly focused on growth, while helping over 5 million low-income Americans who deeply value our product.\nWe’re looking for a\nLifecycle Marketing Manager\nwith a high sense of ownership and creativity to continue our work in growing revenue through email, push and in app channels as well as driving new channel exploration. You’ll report to the Senior Manager, Lifecycle Marketing and partner closely with brand, marketplace, product, product marketing, data and engineering teams.\nWhat You’ll Do\nOptimizing and driving performance of Propel’s lifecycle marketing revenue program - defining strategy, setting channel mix, and driving growth while maintaining strong user engagement\nTranslate strategy into executional excellence - partner with our marketplace and healthcare teams to run high-performing promotional campaigns across core channels (email, push, in app), and test new approaches for optimizing and engagement and conversion\nManage and optimize lifecycle marketing performance, including forecasting and reporting performance to leadership and cross-functional partners\nBuild a high-performing creative engine and developing testing frameworks and workflows that consistently deliver new creative winners\nLead rigorous A/B and incrementality testing, using structured analytics to unearth learnings and drive step-change improvements in performance\nAdvance our attribution and modeling capabilities by determining the optimal approach for attributing conversions and revenue to lifecycle marketing efforts and how to use modeling and other techniques to optimize performance\nCollaborate with marketplace, healthcare, and product teams to drive growth - ensuring cohesive messaging, seamless user journeys, and automating winning strategies to drive growth\nRequirements\n5-7 years managing lifecycle marketing programs for 500K+ users at consumer-tech companies, particularly mobile apps using a modern CRM tech stack (Braze preferred)\nDeep familiarity with email, push, SMS, and in app channels and how to optimize them (Note:  Email coding experience is not required, but must understand html/css basics and be able to QA campaigns)\nDeep understanding of revenue generation strategies (personalization, retargeting, etc.) and tactics across the customer lifecycle (onboarding, reactivation, etc.).\nStrong grasp of lifecycle marketing channel best practices with a trained eye for what wins and why. Track record of building systems and playbooks with creative partners and AI tools to consistently generate high-performing assets across channels\nExceptional analytical thinker —adept at structuring and executing complex analyses to uncover insights, evaluate tradeoffs, and inform high-impact marketing decisions\nClear and persuasive communicator—able to synthesize insights into clear narratives and align stakeholders across marketing, product, data, and finance\nFamiliar with LCM attribution approaches (e.g. UTM’s, holdouts, etc.) and able to speak to the nuances of various attribution approaches\nComfortable managing external agency relationships as well as internal stakeholder relationships with a clear coaching and accountability style\nThrives in high-ownership environments; equally comfortable setting strategy and rolling up sleeves to execute\nAt Propel, you'll enjoy:\nMeaningful work and a strong shared sense of mission\nRemote-friendly work environment with a dog-friendly office in Downtown Brooklyn. The team meets in-person for optional retreats a few times per year.\n20 Days of PTO\n4% 401K match\n$10k lifetime spend towards Carrot Fertility\nExcellent Medical, Dental and Vision options\nOther health and mental health focused benefits and perks\nPropel builds compensation bands referencing the 75th percentile of compensation for companies like us.\nExpected\ncompensation for the role as scoped is\n$120,000 - $135,000\nand will be based on how a candidate matches to our internal leveling guide.\nAdditional Considerations:\nWe are committed to building a diverse and inclusive team, and welcome applicants from all backgrounds and abilities.\nWe're currently accepting applications from the states we have an established entity, which includes\nCalifornia, Colorado, District of Columbia, Florida, Georgia, Illinois, Maryland, Massachusetts, New Jersey, New York, Oregon, Pennsylvania, Texas, Virginia, and Washington\n.\nBackground Check Requirement:\nFor roles with access to confidential employee or customer information, a background check may be conducted following a conditional offer. All background checks are handled in accordance with applicable laws, including the Fair Credit Reporting Act (FCRA).\nMore About Propel\nPropel is a technology company that’s strengthening the social safety net for people who receive government benefits. Over 5 million Americans trust the free, modern Propel app to manage their government benefits, save money, and get updates when their benefits change. We’ve also partnered with renowned institutions and organizations like Vote.org, GoFundMe, and GiveDirectly.\nPropel is a for-profit, venture-backed company that holds its social mission at its core. We're proud to be supported by a blend of nonprofits, impact investors, and world-class investors, including the Robin Hood Foundation, Andreessen Horowitz, Nyca Partners, Financial Health Network, JPMorganChase, Kevin Durant, Serena Williams, and Nas.\nLearn more about our impact from the press\nFintech Company Propel Announces $10 Million Fund For Food Stamp\nLate Show With Stephen Colbert\nHow to Propel the Fight Against Poverty in America\nHow Tech is Helping Poor People Get Government Aid\nPropel Routes Money to those Who Need it Most\nHow one tech startup is giving cash to SNAP recipients\nRecipients Affected By Government Shutdown\nHow hunger relief groups say you can help feed your neighbors during the shutdown and beyond\nHelping our Users Navigate this Crisis\nJoin us, and let's build something amazing together!\nCreate a Job Alert\nInterested in building your career at Propel? Get future opportunities sent straight to your email.\nCreate alert\nApply for this job\n*\nindicates a required field\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\nCountry\n*\nPhone\n*\n244 results found\nNo results found\nAfghanistan\n+93\nÅland Islands\n+358\nAlbania\n+355\nAlgeria\n+213\nAmerican Samoa\n+1\nAndorra\n+376\nAngola\n+244\nAnguilla\n+1\nAntigua & Barbuda\n+1\nArgentina\n+54\nArmenia\n+374\nAruba\n+297\nAscension Island\n+247\nAustralia\n+61\nAustria\n+43\nAzerbaijan\n+994\nBahamas\n+1\nBahrain\n+973\nBangladesh\n+880\nBarbados\n+1\nBelarus\n+375\nBelgium\n+32\nBelize\n+501\nBenin\n+229\nBermuda\n+1\nBhutan\n+975\nBolivia\n+591\nBosnia & Herzegovina\n+387\nBotswana\n+267\nBrazil\n+55\nBritish Indian Ocean Territory\n+246\nBritish Virgin Islands\n+1\nBrunei\n+673\nBulgaria\n+359\nBurkina Faso\n+226\nBurundi\n+257\nCambodia\n+855\nCameroon\n+237\nCanada\n+1\nCape Verde\n+238\nCaribbean Netherlands\n+599\nCayman Islands\n+1\nCentral African Republic\n+236\nChad\n+235\nChile\n+56\nChina\n+86\nChristmas Island\n+61\nCocos (Keeling) Islands\n+61\nColombia\n+57\nComoros\n+269\nCongo - Brazzaville\n+242\nCongo - Kinshasa\n+243\nCook Islands\n+682\nCosta Rica\n+506\nCôte d’Ivoire\n+225\nCroatia\n+385\nCuba\n+53\nCuraçao\n+599\nCyprus\n+357\nCzechia\n+420\nDenmark\n+45\nDjibouti\n+253\nDominica\n+1\nDominican Republic\n+1\nEcuador\n+593\nEgypt\n+20\nEl Salvador\n+503\nEquatorial Guinea\n+240\nEritrea\n+291\nEstonia\n+372\nEswatini\n+268\nEthiopia\n+251\nFalkland Islands\n+500\nFaroe Islands\n+298\nFiji\n+679\nFinland\n+358\nFrance\n+33\nFrench Guiana\n+594\nFrench Polynesia\n+689\nGabon\n+241\nGambia\n+220\nGeorgia\n+995\nGermany\n+49\nGhana\n+233\nGibraltar\n+350\nGreece\n+30\nGreenland\n+299\nGrenada\n+1\nGuadeloupe\n+590\nGuam\n+1\nGuatemala\n+502\nGuernsey\n+44\nGuinea\n+224\nGuinea-Bissau\n+245\nGuyana\n+592\nHaiti\n+509\nHonduras\n+504\nHong Kong SAR China\n+852\nHungary\n+36\nIceland\n+354\nIndia\n+91\nIndonesia\n+62\nIran\n+98\nIraq\n+964\nIreland\n+353\nIsle of Man\n+44\nIsrael\n+972\nItaly\n+39\nJamaica\n+1\nJapan\n+81\nJersey\n+44\nJordan\n+962\nKazakhstan\n+7\nKenya\n+254\nKiribati\n+686\nKosovo\n+383\nKuwait\n+965\nKyrgyzstan\n+996\nLaos\n+856\nLatvia\n+371\nLebanon\n+961\nLesotho\n+266\nLiberia\n+231\nLibya\n+218\nLiechtenstein\n+423\nLithuania\n+370\nLuxembourg\n+352\nMacao SAR China\n+853\nMadagascar\n+261\nMalawi\n+265\nMalaysia\n+60\nMaldives\n+960\nMali\n+223\nMalta\n+356\nMarshall Islands\n+692\nMartinique\n+596\nMauritania\n+222\nMauritius\n+230\nMayotte\n+262\nMexico\n+52\nMicronesia\n+691\nMoldova\n+373\nMonaco\n+377\nMongolia\n+976\nMontenegro\n+382\nMontserrat\n+1\nMorocco\n+212\nMozambique\n+258\nMyanmar (Burma)\n+95\nNamibia\n+264\nNauru\n+674\nNepal\n+977\nNetherlands\n+31\nNew Caledonia\n+687\nNew Zealand\n+64\nNicaragua\n+505\nNiger\n+227\nNigeria\n+234\nNiue\n+683\nNorfolk Island\n+672\nNorth Korea\n+850\nNorth Macedonia\n+389\nNorthern Mariana Islands\n+1\nNorway\n+47\nOman\n+968\nPakistan\n+92\nPalau\n+680\nPalestinian Territories\n+970\nPanama\n+507\nPapua New Guinea\n+675\nParaguay\n+595\nPeru\n+51\nPhilippines\n+63\nPoland\n+48\nPortugal\n+351\nPuerto Rico\n+1\nQatar\n+974\nRéunion\n+262\nRomania\n+40\nRussia\n+7\nRwanda\n+250\nSamoa\n+685\nSan Marino\n+378\nSão Tomé & Príncipe\n+239\nSaudi Arabia\n+966\nSenegal\n+221\nSerbia\n+381\nSeychelles\n+248\nSierra Leone\n+232\nSingapore\n+65\nSint Maarten\n+1\nSlovakia\n+421\nSlovenia\n+386\nSolomon Islands\n+677\nSomalia\n+252\nSouth Africa\n+27\nSouth Korea\n+82\nSouth Sudan\n+211\nSpain\n+34\nSri Lanka\n+94\nSt. Barthélemy\n+590\nSt. Helena\n+290\nSt. Kitts & Nevis\n+1\nSt. Lucia\n+1\nSt. Martin\n+590\nSt. Pierre & Miquelon\n+508\nSt. Vincent & Grenadines\n+1\nSudan\n+249\nSuriname\n+597\nSvalbard & Jan Mayen\n+47\nSweden\n+46\nSwitzerland\n+41\nSyria\n+963\nTaiwan\n+886\nTajikistan\n+992\nTanzania\n+255\nThailand\n+66\nTimor-Leste\n+670\nTogo\n+228\nTokelau\n+690\nTonga\n+676\nTrinidad & Tobago\n+1\nTunisia\n+216\nTurkey\n+90\nTurkmenistan\n+993\nTurks & Caicos Islands\n+1\nTuvalu\n+688\nU.S. Virgin Islands\n+1\nUganda\n+256\nUkraine\n+380\nUnited Arab Emirates\n+971\nUnited Kingdom\n+44\nUnited States\n+1\nUruguay\n+598\nUzbekistan\n+998\nVanuatu\n+678\nVatican City\n+39\nVenezuela\n+58\nVietnam\n+84\nWallis & Futuna\n+681\nWestern Sahara\n+212\nYemen\n+967\nZambia\n+260\nZimbabwe\n+263\nResume/CV\n*\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nCover Letter\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nLinkedIn Profile\nWhere did you hear about Propel?\nWhy does Propel’s mission resonate with you?\n*\nWhich marketing tools do you use in your current or previous roles? Which ones do you feel most comfortable with?\n*\nBriefly tell me about an experiment you recently ran that achieved outsized results.\n*\nAre you authorized to work in the United States for any employer? *\n*\nSelect...\nWill you now or in the future require visa sponsorship? *\n*\nSelect...\nDemographic Questions\nAt Propel, we believe that an environment that is diverse, inclusive, and equitable drives us towards the best product and business decisions that allow us to effectively and consciously serve our mission and our users. As a social enterprise, we also recognize that caring about DEI is quite simply the right thing to do.\nThe people that use our products are diverse in many ways - gender, age, race, sexual orientation, religion, disability status, and more. We explicitly aim to reflect that with our team composition, though we aren’t there yet. That’s why we are actively working to make sure our job descriptions are inclusive, our sourcing nets are widely cast, and our interview process is equitable and fair to all.\nWe particularly value those with lived experiences around financial hardship and safety net programs. While people from all backgrounds can contribute to Propel’s mission, we know that those who come from the communities we serve have an incredibly powerful and unique perspective.\nYour responses will be used (in aggregate only) to help us identify areas of improvement in our process. Your responses\nwill not\nbe associated with your specific application and\nwill not\nin any way be used in the hiring decision.\nI identify my gender as:\n*\nSelect...\nI identify as transgender (select one):\n*\nSelect...\nI identify my sexual orientation as:\n*\nSelect...\nI identify my ethnicity as (mark all that apply):\n*\nSelect...\nVeteran Status (select one):\n*\nSelect...\nI have a physical disability (select one):\n*\nSelect...\nI am a caretaker of children (select one):\n*\nSelect...\nHow would you describe the socioeconomic background you grew up in?\n*\nSelect...\nPowered by\nGreenhouse"
  },
  {
    "title": "Engineering Technical Lead Manager - Enterprise",
    "company_name": "xAI",
    "company_stage": "Growth",
    "location": "New York, NY",
    "industry": "AI, Enterprise",
    "category": "Operations",
    "experience_level": "Lead/Manager",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$180,000 - $440,000",
    "description_url": "https://job-boards.greenhouse.io/xai/jobs/5019194007",
    "required_skills": [
      "Frontend Web Development",
      "Machine Learning",
      "Service",
      "Postgres",
      "English",
      "CockroachDB",
      "Python",
      "Rust",
      "Team Leadership",
      "C/C++",
      "TypeScript",
      "Distributed Systems",
      "Written Communication Skills",
      "Full Stack Development",
      "Physics",
      "Technical Leadership",
      "Observability",
      "Databases",
      "Artificial Intelligence",
      "Integrated Circuit Design"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Job Application for Engineering Technical Lead Manager (TLM) - Enterprise at xAI\nBack to jobs\nNew\nEngineering Technical Lead Manager (TLM) - Enterprise\nNew York, NY\nAbout xAI\nxAI’s mission is to create AI systems that can accurately understand the universe and aid humanity in its pursuit of knowledge.\nOur team is small, highly motivated, and focused on engineering excellence. This organization is for individuals who appreciate challenging themselves and thrive on curiosity.\nWe operate with a flat organizational structure. All employees are expected to be hands-on and to contribute directly to the company’s mission. Leadership is given to those who show initiative and consistently deliver excellence. Work ethic and strong prioritization skills are important.\nAll engineers are expected to have strong communication skills. They should be able to concisely and accurately share knowledge with their teammates.\nAbout the team\nThe Enterprise Engineering Team at xAI is a team of builders solving the hardest problems in applied AI: integrating with messy systems, orchestrating complex workflows, and harnessing AI to transform business operations. We build full-stack solutions with ownership of end-to-end product execution from ideation to deployment, collaborating closely with our team to incorporate cutting-edge AI advancements into robust and reliable user-centric solutions. Through an iterative development process, we work hand-in-hand with customers to gather feedback, refine features, and evolve products to address real-world challenges.\nAbout the role\nAn ideal candidate meets at least the following requirements:\nPeople management experience with ongoing IC/TL responsibilities.\nExpert knowledge of either Rust or C++.\nExperience in designing, implementing, and maintaining reliable and horizontally scalable distributed systems.\nKnowledge of service observability and reliability best practices.\nExperience in operating commonly used databases such as PostgreSQL, Clickhouse, and CockroachDB.\nWho You Are\nStrong passion for solving real-world business problems and delivering measurable impact through AI solutions.\nProven track record of shipping high-quality code and successfully completing projects in challenging environments.\nAbility to navigate ambiguity and adapt to changing requirements and priorities in a fast-paced startup environment.\nStrong communication skills that will become important when interfacing with customers to clarify requirements and drive a project to completion.\nEmphasis on designing, implementing, and maintaining robust and scalable AI-driven solutions.\nProficiency in working with large, complex codebases and designing efficient data processing and model serving architectures\nAn ideal candidate meets at least the following requirements:\n4 to 12 years of software engineering experience, including 1+ year of people management.\nBackground in full stack with in-depth understanding of product architecture.\nProven experience in AI or machine learning product implementation with APIs, back-end, and front-end interfaces.\nExpertise in prompt engineering.\nProven Expertise in Python and/or TypeScript.\nGreat verbal and written communication skills in English.\nAbility to turn business and product ideas into engineering solutions.\nExperience in Python and/or TypeScript.\nUnderstanding of the HTTP protocol.\nStrong engineering background, preferred in fields such as Computer Science, Mathematics, Software Engineering, Physics, and Data Science.\nFurthermore, candidates may stand out by having any of the following experiences:\nPower user of Grok.\nBuilding evals for new capabilities and evaluating our systems.\nDemonstrating an understanding of machine learning fundamentals, including model evaluation, training and fine-tuning.\nExcellent visual, verbal, UI, and interaction skills.\nExperience in client facing sales or delivery focused roles.\nBuilding evals for new capabilities and evaluating our systems.\nDeploying machine learning models to production.\nWriting developer documentation.\nCreating and maintaining SDKs.\nShowcasing the ability to work with massive datasets, optimize performance, and scale systems to handle high-throughput workloads.\nUsing Pulumi or Terraform.\nInterview process\nAfter submitting your application, the team reviews your CV and statement of exceptional work. If your application passes this stage, you will be invited to a 15 minute interview (“phone interview”) during which a member of our team will ask questions. If you clear the initial phone interview, you will proceed to technical interviews. Our goal is to complete the process within one week. All interviews will be conducted in person when applicable.\nLocation\nThe role is based in Palo Alto.\nAnnual Salary Range\n$180,000 - $440,000 USD\nBenefits\nBase salary is just one part of our total rewards package at xAI, which also includes equity, comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short & long-term disability insurance, life insurance, and various other discounts and perks.\nxAI is an equal opportunity employer. For details on data processing, view our\nRecruitment Privacy Notice\n.\nCreate a Job Alert\nInterested in building your career at xAI? Get future opportunities sent straight to your email.\nCreate alert\nApply for this job\n*\nindicates a required field\nFirst Name\n*\nLast Name\n*\nPreferred First Name\nEmail\n*\nPhone\nCountry\nPhone\n244 results found\nNo results found\nAfghanistan\n+93\nÅland Islands\n+358\nAlbania\n+355\nAlgeria\n+213\nAmerican Samoa\n+1\nAndorra\n+376\nAngola\n+244\nAnguilla\n+1\nAntigua & Barbuda\n+1\nArgentina\n+54\nArmenia\n+374\nAruba\n+297\nAscension Island\n+247\nAustralia\n+61\nAustria\n+43\nAzerbaijan\n+994\nBahamas\n+1\nBahrain\n+973\nBangladesh\n+880\nBarbados\n+1\nBelarus\n+375\nBelgium\n+32\nBelize\n+501\nBenin\n+229\nBermuda\n+1\nBhutan\n+975\nBolivia\n+591\nBosnia & Herzegovina\n+387\nBotswana\n+267\nBrazil\n+55\nBritish Indian Ocean Territory\n+246\nBritish Virgin Islands\n+1\nBrunei\n+673\nBulgaria\n+359\nBurkina Faso\n+226\nBurundi\n+257\nCambodia\n+855\nCameroon\n+237\nCanada\n+1\nCape Verde\n+238\nCaribbean Netherlands\n+599\nCayman Islands\n+1\nCentral African Republic\n+236\nChad\n+235\nChile\n+56\nChina\n+86\nChristmas Island\n+61\nCocos (Keeling) Islands\n+61\nColombia\n+57\nComoros\n+269\nCongo - Brazzaville\n+242\nCongo - Kinshasa\n+243\nCook Islands\n+682\nCosta Rica\n+506\nCôte d’Ivoire\n+225\nCroatia\n+385\nCuba\n+53\nCuraçao\n+599\nCyprus\n+357\nCzechia\n+420\nDenmark\n+45\nDjibouti\n+253\nDominica\n+1\nDominican Republic\n+1\nEcuador\n+593\nEgypt\n+20\nEl Salvador\n+503\nEquatorial Guinea\n+240\nEritrea\n+291\nEstonia\n+372\nEswatini\n+268\nEthiopia\n+251\nFalkland Islands\n+500\nFaroe Islands\n+298\nFiji\n+679\nFinland\n+358\nFrance\n+33\nFrench Guiana\n+594\nFrench Polynesia\n+689\nGabon\n+241\nGambia\n+220\nGeorgia\n+995\nGermany\n+49\nGhana\n+233\nGibraltar\n+350\nGreece\n+30\nGreenland\n+299\nGrenada\n+1\nGuadeloupe\n+590\nGuam\n+1\nGuatemala\n+502\nGuernsey\n+44\nGuinea\n+224\nGuinea-Bissau\n+245\nGuyana\n+592\nHaiti\n+509\nHonduras\n+504\nHong Kong SAR China\n+852\nHungary\n+36\nIceland\n+354\nIndia\n+91\nIndonesia\n+62\nIran\n+98\nIraq\n+964\nIreland\n+353\nIsle of Man\n+44\nIsrael\n+972\nItaly\n+39\nJamaica\n+1\nJapan\n+81\nJersey\n+44\nJordan\n+962\nKazakhstan\n+7\nKenya\n+254\nKiribati\n+686\nKosovo\n+383\nKuwait\n+965\nKyrgyzstan\n+996\nLaos\n+856\nLatvia\n+371\nLebanon\n+961\nLesotho\n+266\nLiberia\n+231\nLibya\n+218\nLiechtenstein\n+423\nLithuania\n+370\nLuxembourg\n+352\nMacao SAR China\n+853\nMadagascar\n+261\nMalawi\n+265\nMalaysia\n+60\nMaldives\n+960\nMali\n+223\nMalta\n+356\nMarshall Islands\n+692\nMartinique\n+596\nMauritania\n+222\nMauritius\n+230\nMayotte\n+262\nMexico\n+52\nMicronesia\n+691\nMoldova\n+373\nMonaco\n+377\nMongolia\n+976\nMontenegro\n+382\nMontserrat\n+1\nMorocco\n+212\nMozambique\n+258\nMyanmar (Burma)\n+95\nNamibia\n+264\nNauru\n+674\nNepal\n+977\nNetherlands\n+31\nNew Caledonia\n+687\nNew Zealand\n+64\nNicaragua\n+505\nNiger\n+227\nNigeria\n+234\nNiue\n+683\nNorfolk Island\n+672\nNorth Korea\n+850\nNorth Macedonia\n+389\nNorthern Mariana Islands\n+1\nNorway\n+47\nOman\n+968\nPakistan\n+92\nPalau\n+680\nPalestinian Territories\n+970\nPanama\n+507\nPapua New Guinea\n+675\nParaguay\n+595\nPeru\n+51\nPhilippines\n+63\nPoland\n+48\nPortugal\n+351\nPuerto Rico\n+1\nQatar\n+974\nRéunion\n+262\nRomania\n+40\nRussia\n+7\nRwanda\n+250\nSamoa\n+685\nSan Marino\n+378\nSão Tomé & Príncipe\n+239\nSaudi Arabia\n+966\nSenegal\n+221\nSerbia\n+381\nSeychelles\n+248\nSierra Leone\n+232\nSingapore\n+65\nSint Maarten\n+1\nSlovakia\n+421\nSlovenia\n+386\nSolomon Islands\n+677\nSomalia\n+252\nSouth Africa\n+27\nSouth Korea\n+82\nSouth Sudan\n+211\nSpain\n+34\nSri Lanka\n+94\nSt. Barthélemy\n+590\nSt. Helena\n+290\nSt. Kitts & Nevis\n+1\nSt. Lucia\n+1\nSt. Martin\n+590\nSt. Pierre & Miquelon\n+508\nSt. Vincent & Grenadines\n+1\nSudan\n+249\nSuriname\n+597\nSvalbard & Jan Mayen\n+47\nSweden\n+46\nSwitzerland\n+41\nSyria\n+963\nTaiwan\n+886\nTajikistan\n+992\nTanzania\n+255\nThailand\n+66\nTimor-Leste\n+670\nTogo\n+228\nTokelau\n+690\nTonga\n+676\nTrinidad & Tobago\n+1\nTunisia\n+216\nTurkey\n+90\nTurkmenistan\n+993\nTurks & Caicos Islands\n+1\nTuvalu\n+688\nU.S. Virgin Islands\n+1\nUganda\n+256\nUkraine\n+380\nUnited Arab Emirates\n+971\nUnited Kingdom\n+44\nUnited States\n+1\nUruguay\n+598\nUzbekistan\n+998\nVanuatu\n+678\nVatican City\n+39\nVenezuela\n+58\nVietnam\n+84\nWallis & Futuna\n+681\nWestern Sahara\n+212\nYemen\n+967\nZambia\n+260\nZimbabwe\n+263\nResume/CV\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nCover Letter\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nLinkedIn Profile\nWebsite\nFull Legal Name\n*\nX Profile\nYour Location (City, State)\n*\nWill you now, or in the future, require sponsorship for employment visa status (e.g., H-1B visa) to legally work for in the US?\n*\nSelect...\nWhat exceptional work have you done?\n*\nIn 100 words or less, tell us about a piece of work you are most proud of.\nPowered by\nGreenhouse"
  },
  {
    "title": "Software Engineer - Intelligent Tooling",
    "company_name": "Plaid",
    "company_stage": "Growth",
    "location": "San Francisco",
    "industry": "Fintech",
    "category": "Engineering",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$180,000 - $270,000",
    "description_url": "https://jobs.lever.co/plaid/9d0008bb-dc57-47a1-90ce-46cd3145445d",
    "required_skills": [
      "Infrastructure",
      "Observability",
      "Cloud Infrastructure",
      "Developer Tools",
      "Artificial Intelligence",
      "CI/CD",
      "Automation"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Software Engineer - Intelligent Tooling\nSan Francisco /\nNew York\nEngineering – Engineering /\nFull-time /\nHybrid\nApply for this job\nPlaid is evolving into an AI-first company, and Intelligent Tooling sits at the center of that transformation. The Intelligent Tooling team is being built from the ground up, and our mission is to establish the technical foundations, operating model, and internal platforms that embed AI deeply into Plaid’s coding tools, internal systems, and the entire software development lifecycle.When we are successful, engineers across Plaid will delegate lower-leverage work to AI agents, move faster with confidence, and spend more of their time designing and inventing for customers. Intelligent Tooling owns the platforms and systems that make this possible - from AI coding integrations and SDLC agents to the internal tools that power Plaid’s operations.\nAs a Senior Software Engineer on the Intelligent Tooling team, you will build and operate internal systems that directly impact how engineers across Plaid do their work. This is a hands-on role with significant ownership, where success is measured by real adoption, reliability, and improvements to developer experience.\nYou will work on AI-powered tooling, internal platforms, and developer workflows, collaborating closely with other engineers and cross-functional partners to ship durable, high-leverage systems.\nResponsibilities\nDesign, build, and operate internal tools and services used by Plaid’s engineers.\nIntegrate AI-powered tools and workflows into core engineering processes.\nImprove reliability, usability, and performance of existing internal platforms.\nOwn systems end-to-end, including production support and iterative improvement.\nCollaborate with teammates and stakeholders to deliver practical, high-impact solutions.\nQualifications\n5+ years of professional software engineering experience.\nExperience building and operating production systems.\nHands-on experience using AI-powered developer tools.\nStrong problem-solving and collaboration skills.\n[Nice to have] Experience with developer tooling, internal platforms, or infrastructure.\n[Nice to have] Exposure developing AI systems, automation, or agentic workflows.\n[Nice to have] Familiarity with CI/CD, cloud infrastructure, or observability tooling.\n[Nice to have] Strong interest and excitement in leveraging AI to meaningfully improve developer productivity and engineering velocity for a broader engineering organization.\n$180,000 - $270,000 a year\nThe target base salary for this position ranges from $180,000/year to $270,000/year in Zone 1. The target base salary will vary based on the job's location.\nOur geographic zones are as follows:\nZone 1 - New York City and San Francisco Bay Area\nZone 2 - Los Angeles, Seattle, Washington D.C.\nZone 3 - Austin, Boston, Denver, Houston, Portland, Sacramento, San Diego\nZone 4 - Raleigh-Durham and all other US cities\nAdditional compensation in the form(s) of equity and/or commission are dependent on the position offered. Plaid provides a comprehensive benefit plan, including medical, dental, vision, and 401(k). Pay is based on factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience and skillset, and location. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\nApply for this job"
  },
  {
    "title": "Sr. Manager, Marketing Strategy, Operations and Analytics",
    "company_name": "Shield AI",
    "company_stage": "Growth",
    "location": "United States",
    "industry": "American Dynamism, Enterprise",
    "category": "Operations",
    "experience_level": "Lead/Manager",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$158,000 - $238,000",
    "description_url": "https://jobs.lever.co/shieldai/50b0ac4f-ee85-41fa-8e1a-b3e35772408c",
    "required_skills": [
      "Marketo",
      "Analytics",
      "Tableau",
      "Google Analytics",
      "Infrastructure",
      "Artificial Intelligence",
      "Looker",
      "Marketing Strategy",
      "Strategy Consulting",
      "B2B",
      "Product Operations",
      "Team Leadership",
      "B2C",
      "SQL",
      "Corporate Strategy",
      "Strategic Partnerships",
      "Salesforce",
      "ETL"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Sr. Manager, Marketing Strategy, Operations and Analytics (R4393)\nUnited States\nGrowth Division – Business Development Marketing /\nFull Time Employee /\nRemote\nApply for this job\nFounded in 2015, Shield AI is a venture-backed deep-tech company with the mission of protecting service members and civilians with intelligent systems. Its products include the V-BAT and X-BAT aircraft, Hivemind Enterprise, and the Hivemind Vision product lines. With nine offices and facilities across the U.S., Europe, the Middle East, and the Asia-Pacific, Shield AI’s technology actively supports operations worldwide. For more information, visit\nwww.shield.ai.\nFollow Shield AI on\nLinkedIn\n,\nX\n,\nInstagram\n, and\nYouTube\n.\nShield AI is seeking a dynamic Marketing Strategy, Operations, and Analytics leader who will build the function from scratch and help the Marketing leadership team run a highly efficient and effective organization. This person is a first principles thinker and problem solver who relishes the challenge of working on new problems every day in a fast-paced hypergrowth environment. They are comfortable working with different levels of leadership from the C-level to individual contributors, and they’re especially comfortable rolling up their sleeves to build.\nWhat you'll do:\nOwn planning and governance for the Marketing function at Shield AI\nWork alongside the VP of Marketing Strategy and Operations and the rest of the Marketing leadership team to define annual/quarterly operating plans, define metrics and set targets, allocate budgets, etc.\nWork with the entire Marketing organization to track progress against goals and ensure high fidelity between budget plans and actuals\nWork with cross-functional partners in BD Ops, Product, and the Office of the CEO to ensure that Marketing priorities and investments are aligned with other teams across the company Own executive decision support for the Marketing organization  Work with the Marketing leadership team to define, scope, and analyze key questions for the Marketing function\nLead the preparation of BoD materials and E-team materials on behalf of Marketing\nLead one-off analyses for key questions posed by E-team Partner with Marketing Operations to co-own analytics infrastructure for Marketing\nDevelop data pipelines and data warehouse infrastructure that will serve as the basis for all Marketing analytics workstreams at Shield AI\nWork with the Digital Marketing, Field Marketing, and Marketing Operations teams to define and instrument metrics across the Marketing funnel iHire (United States) Build a team of talented and high achieving strategy and operations professionals globally as Shield AI grows and scale\nRequired qualifications:\n10+ years of strategy and operations experience spanning strategy consulting / corporate strategy, Marketing strategy / Product operations. Diverse experience in B2B AND B2C contexts is preferred.\n5+ years of hands-on analytics experience (SQL, ETL pipelines, dashboard tools) is required\n3+ years of team management experience preferred\n2+ years of working directly with C-level executives preferred\nHands-on experience building analytics infrastructure and using SQL for custom data pulls is required.\nExperience with Google Big Query, Google Analytics, Marketo, Google Looker Studio / Tableau,\nhttp://Salesforce.com\nis preferred\nProven track record of using AI in appropriate scenarios with measurable impact\nProven success building and scaling global operational teams\nExceptional leadership grounded in humility, curiosity, kindness, and decisiveness, with a reputation for building trusted, high-performing teams and partnerships.\nPassion for technology that protects freedom and human life.\n$158,000 - $238,000 a year\nFull-time regular employee offer package:\nPay within range listed + Bonus + Benefits + Equity\nTemporary employee offer package:\nPay within range listed above + temporary benefits package (applicable after 60 days of employment)\nSalary compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, licenses and certifications, and specific work location. All offers are contingent on a cleared background and possible reference check. Military fellows and part-time employees are not eligible for benefits. Please speak to your talent acquisition representative for more information.\n###\nShield AI is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\nApply for this job"
  },
  {
    "title": "Engagement Manager - Professional Services",
    "company_name": "Databricks",
    "company_stage": "Growth",
    "location": "Northeast - United States",
    "industry": "AI, Enterprise",
    "category": "Operations",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$105,400 - $184,525",
    "description_url": "https://databricks.com/company/careers/open-positions/job?gh_jid=8362853002",
    "required_skills": [
      "Equity",
      "Analytics",
      "Compliance",
      "MLFLow",
      "Artificial Intelligence",
      "Customer Facing Roles",
      "Service Delivery",
      "Professional Services",
      "Hiring Practices",
      "Software Project Management",
      "LinkedIn",
      "Delta Lake",
      "State & Local"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Pay Range Transparency\nDatabricks is committed to fair and equitable compensation practices. The pay range(s) for this role is listed below and represents the expected salary range for non-commissionable roles or on-target earnings for commissionable roles.  Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to job-related skills, depth of experience, relevant certifications and training, and specific work location. Based on the factors above, Databricks anticipates utilizing the full width of the range. The total compensation package for this position may also include eligibility for annual performance bonus, equity, and the benefits listed above. For more information regarding which range your location is in visit our page\nhere\n."
  },
  {
    "title": "Director, Talent Acquisition",
    "company_name": "Pomelo Care",
    "company_stage": "Series A",
    "location": "United States",
    "industry": "Bio + Health",
    "category": "HR/People",
    "experience_level": "Executive",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$180,000 - $215,000",
    "description_url": "https://job-boards.greenhouse.io/pomelocare/jobs/5754055004",
    "required_skills": [
      "Recruiting",
      "Applicant Tracking Systems",
      "Hiring Practices",
      "Greenhouse",
      "Full-cycle Recruiting",
      "Data Driven"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Job Application for  Director, Talent Acquisition  at Pomelo Care\nNew\nDirector, Talent Acquisition\nUnited States\nAbout us\nPomelo Care\nis the national leader in evidence-based healthcare for women and children. We deliver personalized, high-quality clinical interventions from reproductive care and pregnancy, infant care and pediatrics, to hormonal health through perimenopause and menopause, with long-term preventive care and condition management. Our model delivers 24/7 multispecialty care to address the medical, behavioral, and social factors that most significantly impact outcomes for women and children. We partner with payers, employers, and providers to expand access to quality healthcare across the system.\nRole Description\nWhat You’ll Do\nDefine and evolve a recruiting strategy that supports near-term hiring needs and long-term company growth.\nLead, coach, and develop a team of recruiters and external partners; build a Talent Acquisition function that is highly respected within the organization.\nPartner with executives, People, and Finance on workforce planning, headcount forecasting, and hiring prioritization.\nEstablish consistent, high-quality hiring standards across interview design, assessment, and decision making; hold team and cross-functional partners accountable to deliver against these goals.\nEnsure a thoughtful, inclusive, and well-communicated candidate experience across all roles.\nStrengthen our employer brand, in partnership with Marketing and other internal stakeholders, positioning us as an employer of choice for high-performance candidates.\nOwn recruiting operations, systems, and tooling to ensure scalability and efficiency.\nDefine and track recruiting metrics and share insights to inform leadership decisions.\nEnsure hiring practices are compliant, equitable, and aligned with compensation philosophy and company values.\nWhat you bring:\n8+ years of recruiting experience with a strong foundation in full-cycle recruiting across technical, non-technical, and leadership roles.\n3+ years of experience leading a recruiting team in high-growth startup or scale-up environments.\nDeep recruiting judgment and credibility built through prior hands-on recruiting experience, with a clear point of view on what great hiring looks like.\nA strong strategic mindset paired with operational rigor and the ability to design recruiting systems that scale.\nExceptional stakeholder management skills with a proven ability to influence executives and hiring managers.\nA data-driven approach to recruiting with strong instincts around which metrics matter most.\nExperience owning and optimizing ATS platforms such as Greenhouse or Ashby, or comparable tools.\nA demonstrated commitment to building diverse, high-performing teams through inclusive hiring practices.\nAt Pomelo, we are committed to hiring the best team to improve outcomes for all mothers and babies, regardless of their background. We need diverse perspectives to reflect the diversity of problems we face and the population we serve. We look to hire people from a variety of backgrounds, including but not limited to race, age, sexual orientation, gender identity and expression, national origin, religion, disability, and veteran status.\nOur salary ranges are based on paying competitively for our company’s size and industry, and are one part of the total compensation package that also includes equity, benefits, and other opportunities at Pomelo Care. In accordance with New York City, Colorado, California, and other applicable laws, Pomelo Care is required to provide a reasonable estimate of the compensation range for this role. Individual pay decisions are ultimately based on a number of factors, including qualifications for the role, experience level, skillset, geography, and balancing internal equity. A reasonable estimate of the current salary range is $180,000-$215,000. We expect most candidates to fall in the middle of the range. We also believe that your personal needs and preferences should be taken into consideration, so we allow some choice between equity and cash.\n#LI-Remote\nPotential Fraud Warning\nPlease be cautious of potential recruitment fraud. With the increase of remote work and digital hiring, phishing and job scams are on the rise with malicious actors impersonating real employees and sending fake job offers in an effort to collect personal or financial information.\nPomelo Care will never ask you to pay a fee or download software as part of the interview process with our company. Pomelo Care will also never ask for your personal banking or other financial information until after you have signed an offer of employment and completed onboarding paperwork that is provided by our People Operations team. All official communication with Pomelo Care People Operations team will come from domain email addresses ending in @pomelocare.com.\nIf you receive a message that seems suspicious, we encourage you to pause communication and contact us directly at\ncareers@pomelocare.com\nto confirm its legitimacy. For your safety, we also recommend applying only through our official\nCareers\npage. If you believe you have been the victim of a scam or identity theft, please contact your local law enforcement agency or another trusted authority for guidance.\nCreate a Job Alert\nInterested in building your career at Pomelo Care? Get future opportunities sent straight to your email.\nCreate alert\nApply for this job\n*\nindicates a required field\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\nCountry\nPhone\n244 results found\nNo results found\nAfghanistan\n+93\nÅland Islands\n+358\nAlbania\n+355\nAlgeria\n+213\nAmerican Samoa\n+1\nAndorra\n+376\nAngola\n+244\nAnguilla\n+1\nAntigua & Barbuda\n+1\nArgentina\n+54\nArmenia\n+374\nAruba\n+297\nAscension Island\n+247\nAustralia\n+61\nAustria\n+43\nAzerbaijan\n+994\nBahamas\n+1\nBahrain\n+973\nBangladesh\n+880\nBarbados\n+1\nBelarus\n+375\nBelgium\n+32\nBelize\n+501\nBenin\n+229\nBermuda\n+1\nBhutan\n+975\nBolivia\n+591\nBosnia & Herzegovina\n+387\nBotswana\n+267\nBrazil\n+55\nBritish Indian Ocean Territory\n+246\nBritish Virgin Islands\n+1\nBrunei\n+673\nBulgaria\n+359\nBurkina Faso\n+226\nBurundi\n+257\nCambodia\n+855\nCameroon\n+237\nCanada\n+1\nCape Verde\n+238\nCaribbean Netherlands\n+599\nCayman Islands\n+1\nCentral African Republic\n+236\nChad\n+235\nChile\n+56\nChina\n+86\nChristmas Island\n+61\nCocos (Keeling) Islands\n+61\nColombia\n+57\nComoros\n+269\nCongo - Brazzaville\n+242\nCongo - Kinshasa\n+243\nCook Islands\n+682\nCosta Rica\n+506\nCôte d’Ivoire\n+225\nCroatia\n+385\nCuba\n+53\nCuraçao\n+599\nCyprus\n+357\nCzechia\n+420\nDenmark\n+45\nDjibouti\n+253\nDominica\n+1\nDominican Republic\n+1\nEcuador\n+593\nEgypt\n+20\nEl Salvador\n+503\nEquatorial Guinea\n+240\nEritrea\n+291\nEstonia\n+372\nEswatini\n+268\nEthiopia\n+251\nFalkland Islands\n+500\nFaroe Islands\n+298\nFiji\n+679\nFinland\n+358\nFrance\n+33\nFrench Guiana\n+594\nFrench Polynesia\n+689\nGabon\n+241\nGambia\n+220\nGeorgia\n+995\nGermany\n+49\nGhana\n+233\nGibraltar\n+350\nGreece\n+30\nGreenland\n+299\nGrenada\n+1\nGuadeloupe\n+590\nGuam\n+1\nGuatemala\n+502\nGuernsey\n+44\nGuinea\n+224\nGuinea-Bissau\n+245\nGuyana\n+592\nHaiti\n+509\nHonduras\n+504\nHong Kong SAR China\n+852\nHungary\n+36\nIceland\n+354\nIndia\n+91\nIndonesia\n+62\nIran\n+98\nIraq\n+964\nIreland\n+353\nIsle of Man\n+44\nIsrael\n+972\nItaly\n+39\nJamaica\n+1\nJapan\n+81\nJersey\n+44\nJordan\n+962\nKazakhstan\n+7\nKenya\n+254\nKiribati\n+686\nKosovo\n+383\nKuwait\n+965\nKyrgyzstan\n+996\nLaos\n+856\nLatvia\n+371\nLebanon\n+961\nLesotho\n+266\nLiberia\n+231\nLibya\n+218\nLiechtenstein\n+423\nLithuania\n+370\nLuxembourg\n+352\nMacao SAR China\n+853\nMadagascar\n+261\nMalawi\n+265\nMalaysia\n+60\nMaldives\n+960\nMali\n+223\nMalta\n+356\nMarshall Islands\n+692\nMartinique\n+596\nMauritania\n+222\nMauritius\n+230\nMayotte\n+262\nMexico\n+52\nMicronesia\n+691\nMoldova\n+373\nMonaco\n+377\nMongolia\n+976\nMontenegro\n+382\nMontserrat\n+1\nMorocco\n+212\nMozambique\n+258\nMyanmar (Burma)\n+95\nNamibia\n+264\nNauru\n+674\nNepal\n+977\nNetherlands\n+31\nNew Caledonia\n+687\nNew Zealand\n+64\nNicaragua\n+505\nNiger\n+227\nNigeria\n+234\nNiue\n+683\nNorfolk Island\n+672\nNorth Korea\n+850\nNorth Macedonia\n+389\nNorthern Mariana Islands\n+1\nNorway\n+47\nOman\n+968\nPakistan\n+92\nPalau\n+680\nPalestinian Territories\n+970\nPanama\n+507\nPapua New Guinea\n+675\nParaguay\n+595\nPeru\n+51\nPhilippines\n+63\nPoland\n+48\nPortugal\n+351\nPuerto Rico\n+1\nQatar\n+974\nRéunion\n+262\nRomania\n+40\nRussia\n+7\nRwanda\n+250\nSamoa\n+685\nSan Marino\n+378\nSão Tomé & Príncipe\n+239\nSaudi Arabia\n+966\nSenegal\n+221\nSerbia\n+381\nSeychelles\n+248\nSierra Leone\n+232\nSingapore\n+65\nSint Maarten\n+1\nSlovakia\n+421\nSlovenia\n+386\nSolomon Islands\n+677\nSomalia\n+252\nSouth Africa\n+27\nSouth Korea\n+82\nSouth Sudan\n+211\nSpain\n+34\nSri Lanka\n+94\nSt. Barthélemy\n+590\nSt. Helena\n+290\nSt. Kitts & Nevis\n+1\nSt. Lucia\n+1\nSt. Martin\n+590\nSt. Pierre & Miquelon\n+508\nSt. Vincent & Grenadines\n+1\nSudan\n+249\nSuriname\n+597\nSvalbard & Jan Mayen\n+47\nSweden\n+46\nSwitzerland\n+41\nSyria\n+963\nTaiwan\n+886\nTajikistan\n+992\nTanzania\n+255\nThailand\n+66\nTimor-Leste\n+670\nTogo\n+228\nTokelau\n+690\nTonga\n+676\nTrinidad & Tobago\n+1\nTunisia\n+216\nTurkey\n+90\nTurkmenistan\n+993\nTurks & Caicos Islands\n+1\nTuvalu\n+688\nU.S. Virgin Islands\n+1\nUganda\n+256\nUkraine\n+380\nUnited Arab Emirates\n+971\nUnited Kingdom\n+44\nUnited States\n+1\nUruguay\n+598\nUzbekistan\n+998\nVanuatu\n+678\nVatican City\n+39\nVenezuela\n+58\nVietnam\n+84\nWallis & Futuna\n+681\nWestern Sahara\n+212\nYemen\n+967\nZambia\n+260\nZimbabwe\n+263\nResume/CV\n*\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nDo you currently reside in the US?\n*\nSelect...\nAre you authorized to work in the US?\n*\nSelect...\nWill you require sponsorship to work now or in the future?\n*\nSelect...\nHow did you hear about us?\n*\nWhich state do you reside in?\n*\nSelect...\nVoluntary Self-Identification\nFor government reporting purposes, we ask candidates to respond to the below self-identification survey.\nCompletion of the form is entirely voluntary. Whatever your decision, it will not be considered in the hiring\nprocess or thereafter. Any information that you do provide will be recorded and maintained in a\nconfidential file.\nAs set forth in Pomelo Care’s Equal Employment Opportunity policy,\nwe do not discriminate on the basis of any protected group status under any applicable law.\nGender\nSelect...\nAre you Hispanic/Latino?\nSelect...\nRace & Ethnicity Definitions\nIf you believe you belong to any of the categories of protected veterans listed below, please indicate by making the appropriate selection.\n  As a government contractor subject to the Vietnam Era Veterans Readjustment Assistance Act (VEVRAA), we request this information in order to measure\n  the effectiveness of the outreach and positive recruitment efforts we undertake pursuant to VEVRAA. Classification of protected categories\n  is as follows:\nA \"disabled veteran\" is one of the following: a veteran of the U.S. military, ground, naval or air service who is entitled to compensation (or who but for the receipt of military retired pay would be entitled to compensation) under laws administered by the Secretary of Veterans Affairs; or a person who was discharged or released from active duty because of a service-connected disability.\nA \"recently separated veteran\" means any veteran during the three-year period beginning on the date of such veteran's discharge or release from active duty in the U.S. military, ground, naval, or air service.\nAn \"active duty wartime or campaign badge veteran\" means a veteran who served on active duty in the U.S. military, ground, naval or air service during a war, or in a campaign or expedition for which a campaign badge has been authorized under the laws administered by the Department of Defense.\nAn \"Armed forces service medal veteran\" means a veteran who, while serving on active duty in the U.S. military, ground, naval or air service, participated in a United States military operation for which an Armed Forces service medal was awarded pursuant to Executive Order 12985.\nVeteran Status\nSelect...\nVoluntary Self-Identification of Disability\nForm CC-305\nPage 1 of 1\nOMB Control Number 1250-0005\nExpires 04/30/2026\nWhy are you being asked to complete this form?\nWe are a federal contractor or subcontractor. The law requires us to provide equal employment opportunity to qualified people with disabilities. We have a goal of having at least 7% of our workers as people with disabilities. The law says we must measure our progress towards this goal. To do this, we must ask applicants and employees if they have a disability or have ever had one. People can become disabled, so we need to ask this question at least every five years.\nCompleting this form is voluntary, and we hope that you will choose to do so. Your answer is confidential. No one who makes hiring decisions will see it. Your decision to complete the form and your answer will not harm you in any way. If you want to learn more about the law or this form, visit the U.S. Department of Labor’s Office of Federal Contract Compliance Programs (OFCCP) website at\nwww.dol.gov/ofccp\n.\nHow do you know if you have a disability?\nA disability is a condition that substantially limits one or more of your “major life activities.” If you have or have ever had such a condition, you are a person with a disability.\nDisabilities include, but are not limited to:\nAlcohol or other substance use disorder (not currently using drugs illegally)\nAutoimmune disorder, for example, lupus, fibromyalgia, rheumatoid arthritis, HIV/AIDS\nBlind or low vision\nCancer (past or present)\nCardiovascular or heart disease\nCeliac disease\nCerebral palsy\nDeaf or serious difficulty hearing\nDiabetes\nDisfigurement, for example, disfigurement caused by burns, wounds, accidents, or congenital disorders\nEpilepsy or other seizure disorder\nGastrointestinal disorders, for example, Crohn's Disease, irritable bowel syndrome\nIntellectual or developmental disability\nMental health conditions, for example, depression, bipolar disorder, anxiety disorder, schizophrenia, PTSD\nMissing limbs or partially missing limbs\nMobility impairment, benefiting from the use of a wheelchair, scooter, walker, leg brace(s) and/or other supports\nNervous system condition, for example, migraine headaches, Parkinson’s disease, multiple sclerosis (MS)\nNeurodivergence, for example, attention-deficit/hyperactivity disorder (ADHD), autism spectrum disorder, dyslexia, dyspraxia, other learning disabilities\nPartial or complete paralysis (any cause)\nPulmonary or respiratory conditions, for example, tuberculosis, asthma, emphysema\nShort stature (dwarfism)\nTraumatic brain injury\nDisability Status\nSelect...\nPUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no persons are required to respond to a collection of information unless such collection displays a valid OMB control number. This survey should take about 5 minutes to complete.\nPowered by\nGreenhouse"
  },
  {
    "title": "Enterprise Solution Consultant - R&D",
    "company_name": "Benchling",
    "company_stage": "Growth",
    "location": "Princeton, New Jersey",
    "industry": "Bio + Health",
    "category": "Sales",
    "experience_level": "Senior",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$119,000 - $175,000",
    "description_url": "https://boards.greenhouse.io/benchling/jobs/7524884?gh_jid=7524884",
    "required_skills": [
      "Biotechnology",
      "Goods",
      "Elastin",
      "Life Sciences",
      "Research",
      "Professional Services",
      "Pre-sales",
      "Software as a Service",
      "LIMS",
      "Sales Leadership"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Job Application for Enterprise Solution Consultant - R&D at Benchling\nBack to jobs\nNew\nEnterprise Solution Consultant - R&D\nPrinceton, New Jersey\nBiotechnology is rewriting life as we know it, from the medicines we take, to the crops we grow, the materials we wear, and the household goods that we rely on every day. But moving at the new speed of science requires better technology.\nBenchling’s mission is to unlock the power of biotechnology. The world’s most innovative biotech companies use Benchling’s R&D Cloud to power the development of breakthrough products and accelerate time to milestone and market.\nCome help us bring modern software to modern science.\nROLE OVERVIEW\nBenchling Enterprise Solution Consultants (SC) are the primary solution leads with Benchling’s largest customers and prospects. Their solutions are deployed into complex enterprise IT environments, interfacing with other vendor solutions, lab instruments, and legacy applications. This is a highly visible role that partners with both external and internal teams to develop the optimal solutions that drive the most value for our customers. The Enterprise SC is a pre-sales role, and as such works closely with Benchling sales leadership, account executives, professional services, and product leaders to ensure the best solutions are presented. Enterprise SCs work with senior scientific and IT leaders from prospects and customers, to establish credibility and confidence from the first meeting, and to create solutions based on cutting-edge technologies.\nThe Enterprise SC must be comfortable with Life Sciences R&D processes and scientific concepts, have experience with enterprise SaaS solutions, and be adept at working with internal and external leaders and stakeholders. You must work as a trusted adviser to translate customer objectives into detailed solutions and effectively communicate and demonstrate those solutions to prospects and customers.\nRESPONSIBILITIES\nEffectively partner with account executives, SC peers, and leadership to create account and deal strategies that lead to selection, planning out customer engagements that lead to compelling solutions.\nManage organized discoveries to uncover customer needs and requirements that relate to decision criteria and key business issues.\nCraft solutions based on Benchling capabilities, industry best practices and standard R&D functions, with data models and processes that map to the customer or prospects' science and that fit into their current technology landscape.\nPresent and demonstrate the solution in a persuasive way based on key messages, decision criteria, and key business issues. Manage customer questions and objections and resolve concerns. Ensure that the solution is presented competitively, with awareness of alternatives including build in house.\nEngage with product management to provide insight into prospect and customer needs and industry trends. Influence the roadmap for market success. Ensure that the roadmap is clear to customers as required to influence buying decisions.\nProvide leadership by creating reusable solutions, content, and trainings for key areas. Work with the extended team to ensure that they are successful and learn from your expertise. Mentor and partner with other SCs to build their success.\nQUALIFICATIONS\nPhD in Biology, Molecular Biology, Genetics, Biotechnology, Bioengineering or similar Life Science field, with a minimum of 4 years of work experience, ideally customer facing.\nExperience with scientific/informatics software such as LIMS, ELN, or others preferred. Experience in demonstrating scientific software in a pre-sales setting highly desired.\nDemonstrated capacity to effectively model scientific data, and craft solutions, based on product knowledge and industry best practices. Prior experience in demonstrating and supporting research instruments, reagents or software desired.\nUnderstand research technology generally adopted by biopharma companies.\nHave an agile and adaptable mentality, and can quickly implement new customer engagement processes.\nAbility to establish as a trusted advisor for scientists, and successfully pitch to scientific buyers.\nWillingness to travel to customer sites 25-30%.\nSALARY RANGE\nBenchling takes a market-based approach to pay. The candidate's starting pay will be determined based on job-related skills, experience, qualifications, interview performance, and work location. For this role the base salary range is $119,000 - $175,000. However, because this role is eligible to participate in Benchling's commission plan, it is common for employees in this role to receive total on-target earnings of $148,750 - $218,750.\nTotal Compensation includes the following:\nCompetitive salary and equity\nBroad range of medical, dental, and vision plans for employees and their dependents\nFertility healthcare and family-forming benefits\nFour months of fully paid parental leave\n401(k) + Employer Match\nCommuter benefits for in-office employees and a generous home office set up stipend for remote employees\nMental health benefits, including therapy and coaching, for employees and their dependents\nMonthly Wellness stipend\nLearning and development stipend\nGenerous and flexible vacation\nCompany-wide Winter holiday shutdown\nSabbaticals for 5-year and 10-year anniversaries\n#LI-Remote\n#BI-Remote\n#LI-KW2\nBenchling welcomes everyone.\nWe believe diversity enriches our team so we hire people with a wide range of identities, backgrounds, and experiences.\nWe are an equal opportunity employer. That means we don’t discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We also consider for employment qualified applicants with arrest and conviction records, consistent with applicable federal, state and local law, including but not limited to the San Francisco Fair Chance Ordinance.\nPlease be aware that Benchling will never request personal information, payment, or sensitive details outside of Greenhouse or via email. All official communications will come from an @benchling.com email address or from an approved vendor alias. If you are contacted by someone claiming to represent Benchling and are unsure of their legitimacy, please reach out to us at recruiting-fraud-alert@benchling.com to verify the communication.\nApply for this job\n*\nindicates a required field\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\nCountry\nPhone\n244 results found\nNo results found\nAfghanistan\n+93\nÅland Islands\n+358\nAlbania\n+355\nAlgeria\n+213\nAmerican Samoa\n+1\nAndorra\n+376\nAngola\n+244\nAnguilla\n+1\nAntigua & Barbuda\n+1\nArgentina\n+54\nArmenia\n+374\nAruba\n+297\nAscension Island\n+247\nAustralia\n+61\nAustria\n+43\nAzerbaijan\n+994\nBahamas\n+1\nBahrain\n+973\nBangladesh\n+880\nBarbados\n+1\nBelarus\n+375\nBelgium\n+32\nBelize\n+501\nBenin\n+229\nBermuda\n+1\nBhutan\n+975\nBolivia\n+591\nBosnia & Herzegovina\n+387\nBotswana\n+267\nBrazil\n+55\nBritish Indian Ocean Territory\n+246\nBritish Virgin Islands\n+1\nBrunei\n+673\nBulgaria\n+359\nBurkina Faso\n+226\nBurundi\n+257\nCambodia\n+855\nCameroon\n+237\nCanada\n+1\nCape Verde\n+238\nCaribbean Netherlands\n+599\nCayman Islands\n+1\nCentral African Republic\n+236\nChad\n+235\nChile\n+56\nChina\n+86\nChristmas Island\n+61\nCocos (Keeling) Islands\n+61\nColombia\n+57\nComoros\n+269\nCongo - Brazzaville\n+242\nCongo - Kinshasa\n+243\nCook Islands\n+682\nCosta Rica\n+506\nCôte d’Ivoire\n+225\nCroatia\n+385\nCuba\n+53\nCuraçao\n+599\nCyprus\n+357\nCzechia\n+420\nDenmark\n+45\nDjibouti\n+253\nDominica\n+1\nDominican Republic\n+1\nEcuador\n+593\nEgypt\n+20\nEl Salvador\n+503\nEquatorial Guinea\n+240\nEritrea\n+291\nEstonia\n+372\nEswatini\n+268\nEthiopia\n+251\nFalkland Islands\n+500\nFaroe Islands\n+298\nFiji\n+679\nFinland\n+358\nFrance\n+33\nFrench Guiana\n+594\nFrench Polynesia\n+689\nGabon\n+241\nGambia\n+220\nGeorgia\n+995\nGermany\n+49\nGhana\n+233\nGibraltar\n+350\nGreece\n+30\nGreenland\n+299\nGrenada\n+1\nGuadeloupe\n+590\nGuam\n+1\nGuatemala\n+502\nGuernsey\n+44\nGuinea\n+224\nGuinea-Bissau\n+245\nGuyana\n+592\nHaiti\n+509\nHonduras\n+504\nHong Kong SAR China\n+852\nHungary\n+36\nIceland\n+354\nIndia\n+91\nIndonesia\n+62\nIran\n+98\nIraq\n+964\nIreland\n+353\nIsle of Man\n+44\nIsrael\n+972\nItaly\n+39\nJamaica\n+1\nJapan\n+81\nJersey\n+44\nJordan\n+962\nKazakhstan\n+7\nKenya\n+254\nKiribati\n+686\nKosovo\n+383\nKuwait\n+965\nKyrgyzstan\n+996\nLaos\n+856\nLatvia\n+371\nLebanon\n+961\nLesotho\n+266\nLiberia\n+231\nLibya\n+218\nLiechtenstein\n+423\nLithuania\n+370\nLuxembourg\n+352\nMacao SAR China\n+853\nMadagascar\n+261\nMalawi\n+265\nMalaysia\n+60\nMaldives\n+960\nMali\n+223\nMalta\n+356\nMarshall Islands\n+692\nMartinique\n+596\nMauritania\n+222\nMauritius\n+230\nMayotte\n+262\nMexico\n+52\nMicronesia\n+691\nMoldova\n+373\nMonaco\n+377\nMongolia\n+976\nMontenegro\n+382\nMontserrat\n+1\nMorocco\n+212\nMozambique\n+258\nMyanmar (Burma)\n+95\nNamibia\n+264\nNauru\n+674\nNepal\n+977\nNetherlands\n+31\nNew Caledonia\n+687\nNew Zealand\n+64\nNicaragua\n+505\nNiger\n+227\nNigeria\n+234\nNiue\n+683\nNorfolk Island\n+672\nNorth Korea\n+850\nNorth Macedonia\n+389\nNorthern Mariana Islands\n+1\nNorway\n+47\nOman\n+968\nPakistan\n+92\nPalau\n+680\nPalestinian Territories\n+970\nPanama\n+507\nPapua New Guinea\n+675\nParaguay\n+595\nPeru\n+51\nPhilippines\n+63\nPoland\n+48\nPortugal\n+351\nPuerto Rico\n+1\nQatar\n+974\nRéunion\n+262\nRomania\n+40\nRussia\n+7\nRwanda\n+250\nSamoa\n+685\nSan Marino\n+378\nSão Tomé & Príncipe\n+239\nSaudi Arabia\n+966\nSenegal\n+221\nSerbia\n+381\nSeychelles\n+248\nSierra Leone\n+232\nSingapore\n+65\nSint Maarten\n+1\nSlovakia\n+421\nSlovenia\n+386\nSolomon Islands\n+677\nSomalia\n+252\nSouth Africa\n+27\nSouth Korea\n+82\nSouth Sudan\n+211\nSpain\n+34\nSri Lanka\n+94\nSt. Barthélemy\n+590\nSt. Helena\n+290\nSt. Kitts & Nevis\n+1\nSt. Lucia\n+1\nSt. Martin\n+590\nSt. Pierre & Miquelon\n+508\nSt. Vincent & Grenadines\n+1\nSudan\n+249\nSuriname\n+597\nSvalbard & Jan Mayen\n+47\nSweden\n+46\nSwitzerland\n+41\nSyria\n+963\nTaiwan\n+886\nTajikistan\n+992\nTanzania\n+255\nThailand\n+66\nTimor-Leste\n+670\nTogo\n+228\nTokelau\n+690\nTonga\n+676\nTrinidad & Tobago\n+1\nTunisia\n+216\nTurkey\n+90\nTurkmenistan\n+993\nTurks & Caicos Islands\n+1\nTuvalu\n+688\nU.S. Virgin Islands\n+1\nUganda\n+256\nUkraine\n+380\nUnited Arab Emirates\n+971\nUnited Kingdom\n+44\nUnited States\n+1\nUruguay\n+598\nUzbekistan\n+998\nVanuatu\n+678\nVatican City\n+39\nVenezuela\n+58\nVietnam\n+84\nWallis & Futuna\n+681\nWestern Sahara\n+212\nYemen\n+967\nZambia\n+260\nZimbabwe\n+263\nResume/CV\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nCover Letter\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nLinkedIn Profile\nWebsite\nPronouns\nSelect...\nU.S. Work Authorization Status\n*\nSelect...\nWill you now, or sometime in the future, require visa sponsorship?\n*\nSelect...\nI acknowledge by submitting an application for this role that I accept and agree to Benchling's global applicant privacy policy, which may be accessed on the link below:\n*\nSelect...\nBenchling Privacy Policy (English)\nBenchling Privacy Policy (German)\nBenchling Privacy Policy (French)\nU.S. Standard Demographic Questions\nWe invite applicants to share their demographic background. If you choose to complete this survey, your responses may be used to identify areas of improvement in our hiring process.\nHow would you describe your gender identity? (mark all that apply)\nSelect...\nHow would you describe your racial/ethnic background? (mark all that apply)\nSelect...\nHow would you describe your sexual orientation? (mark all that apply)\nSelect...\nDo you identify as transgender?\nSelect...\nDo you have a disability or chronic condition (physical, visual, auditory, cognitive, mental, emotional, or other) that substantially limits one or more of your major life activities, including mobility, communication (seeing, hearing, speaking), and learning?\nSelect...\nAre you a veteran or active member of the United States Armed Forces?\nSelect...\nVoluntary Self-Identification\nFor government reporting purposes, we ask candidates to respond to the below self-identification survey.\nCompletion of the form is entirely voluntary. Whatever your decision, it will not be considered in the hiring\nprocess or thereafter. Any information that you do provide will be recorded and maintained in a\nconfidential file.\nAs set forth in Benchling’s Equal Employment Opportunity policy,\nwe do not discriminate on the basis of any protected group status under any applicable law.\nGender\nSelect...\nAre you Hispanic/Latino?\nSelect...\nRace & Ethnicity Definitions\nIf you believe you belong to any of the categories of protected veterans listed below, please indicate by making the appropriate selection.\n  As a government contractor subject to the Vietnam Era Veterans Readjustment Assistance Act (VEVRAA), we request this information in order to measure\n  the effectiveness of the outreach and positive recruitment efforts we undertake pursuant to VEVRAA. Classification of protected categories\n  is as follows:\nA \"disabled veteran\" is one of the following: a veteran of the U.S. military, ground, naval or air service who is entitled to compensation (or who but for the receipt of military retired pay would be entitled to compensation) under laws administered by the Secretary of Veterans Affairs; or a person who was discharged or released from active duty because of a service-connected disability.\nA \"recently separated veteran\" means any veteran during the three-year period beginning on the date of such veteran's discharge or release from active duty in the U.S. military, ground, naval, or air service.\nAn \"active duty wartime or campaign badge veteran\" means a veteran who served on active duty in the U.S. military, ground, naval or air service during a war, or in a campaign or expedition for which a campaign badge has been authorized under the laws administered by the Department of Defense.\nAn \"Armed forces service medal veteran\" means a veteran who, while serving on active duty in the U.S. military, ground, naval or air service, participated in a United States military operation for which an Armed Forces service medal was awarded pursuant to Executive Order 12985.\nVeteran Status\nSelect...\nVoluntary Self-Identification of Disability\nForm CC-305\nPage 1 of 1\nOMB Control Number 1250-0005\nExpires 04/30/2026\nWhy are you being asked to complete this form?\nWe are a federal contractor or subcontractor. The law requires us to provide equal employment opportunity to qualified people with disabilities. We have a goal of having at least 7% of our workers as people with disabilities. The law says we must measure our progress towards this goal. To do this, we must ask applicants and employees if they have a disability or have ever had one. People can become disabled, so we need to ask this question at least every five years.\nCompleting this form is voluntary, and we hope that you will choose to do so. Your answer is confidential. No one who makes hiring decisions will see it. Your decision to complete the form and your answer will not harm you in any way. If you want to learn more about the law or this form, visit the U.S. Department of Labor’s Office of Federal Contract Compliance Programs (OFCCP) website at\nwww.dol.gov/ofccp\n.\nHow do you know if you have a disability?\nA disability is a condition that substantially limits one or more of your “major life activities.” If you have or have ever had such a condition, you are a person with a disability.\nDisabilities include, but are not limited to:\nAlcohol or other substance use disorder (not currently using drugs illegally)\nAutoimmune disorder, for example, lupus, fibromyalgia, rheumatoid arthritis, HIV/AIDS\nBlind or low vision\nCancer (past or present)\nCardiovascular or heart disease\nCeliac disease\nCerebral palsy\nDeaf or serious difficulty hearing\nDiabetes\nDisfigurement, for example, disfigurement caused by burns, wounds, accidents, or congenital disorders\nEpilepsy or other seizure disorder\nGastrointestinal disorders, for example, Crohn's Disease, irritable bowel syndrome\nIntellectual or developmental disability\nMental health conditions, for example, depression, bipolar disorder, anxiety disorder, schizophrenia, PTSD\nMissing limbs or partially missing limbs\nMobility impairment, benefiting from the use of a wheelchair, scooter, walker, leg brace(s) and/or other supports\nNervous system condition, for example, migraine headaches, Parkinson’s disease, multiple sclerosis (MS)\nNeurodivergence, for example, attention-deficit/hyperactivity disorder (ADHD), autism spectrum disorder, dyslexia, dyspraxia, other learning disabilities\nPartial or complete paralysis (any cause)\nPulmonary or respiratory conditions, for example, tuberculosis, asthma, emphysema\nShort stature (dwarfism)\nTraumatic brain injury\nDisability Status\nSelect...\nPUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no persons are required to respond to a collection of information unless such collection displays a valid OMB control number. This survey should take about 5 minutes to complete.\nPowered by\nGreenhouse"
  },
  {
    "title": "Director of Marketing Operations",
    "company_name": "Mixpanel",
    "company_stage": "Growth",
    "location": "San Francisco, US (Hybrid)",
    "industry": "Enterprise",
    "category": "Marketing",
    "experience_level": "Executive",
    "remote_option": false,
    "is_hybrid": true,
    "salary_range": "$206,000 - $310,000",
    "description_url": "https://job-boards.greenhouse.io/mixpanel/jobs/7511931",
    "required_skills": [
      "Processes Development",
      "Analytical Skills",
      "Marketing Technology",
      "Product Marketing",
      "Team Leadership",
      "Project Management",
      "Marketing Operations",
      "Automation",
      "Data Driven",
      "Actionable Insights",
      "Looker",
      "Process Optimization",
      "HubSpot",
      "SQL",
      "Salesforce",
      "Google Analytics",
      "Analytics",
      "Driving Results",
      "Artificial Intelligence",
      "Mixpanel",
      "Decision-Making",
      "Strategic Thinking"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Compensation\nThe amount listed below is the total target cash compensation (TTCC) and includes base compensation and variable compensation in the form of either a company bonus or commissions. Variable compensation type is determined by your role and level. In addition to the cash compensation provided, this position is also eligible for equity consideration and other benefits including medical, vision, and dental insurance coverage. You can view our benefits offerings\nhere\n.\nOur salary ranges are determined by role and level and are benchmarked to the SF Bay Area Technology data cut released by Radford, a global compensation database. The range displayed represents the minimum and maximum TTCC for new hire salaries for the position across all of our US locations. To stay on top of market conditions, we refresh our salary ranges twice a year so these ranges may change in the future. Within the range, individual pay is determined by experience, job-related skills, qualifications, and other factors. If you have questions about the specific range, your recruiter can share this information."
  },
  {
    "title": "L&D Consultant",
    "company_name": "Cross River",
    "company_stage": "Growth",
    "location": "Fort Lee, New Jersey, United States",
    "industry": "Fintech",
    "category": "HR/People",
    "experience_level": "Mid",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$40 - $60",
    "description_url": "https://www.crossriver.com/greenhouse?gh_jid=7583039003",
    "required_skills": [
      "Visual Design",
      "Organizational Development",
      "Learning and Development",
      "Learning Management Systems",
      "Articulate Storyline",
      "Instructional Design",
      "Finance",
      "Blended Learning",
      "Regulatory Compliance"
    ],
    "employee_count": "1000+ employees",
    "full_description": "See Job Post\nWe value your privacy\nWe use cookies to enhance your browsing experience, serve personalized ads or content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies.\nCustomize Consent Preferences\nWe use cookies to help you navigate efficiently and perform certain functions. You will find detailed information about all cookies under each consent category below.\nThe cookies that are categorized as \"Necessary\" are stored on your browser as they are essential for enabling the basic functionalities of the site....\nAlways Active\nNecessary cookies are required to enable the basic features of this site, such as providing secure log-in or adjusting your consent preferences. These cookies do not store any personally identifiable data.\nCookie\n__cf_bm\nDuration\n1 hour\nDescription\nThis cookie, set by Cloudflare, is used to support Cloudflare Bot Management.\nCookie\n_cfuvid\nDuration\nsession\nDescription\nCalendly sets this cookie to track users across sessions to optimize user experience by maintaining session consistency and providing personalized services\nCookie\nrc::a\nDuration\nNever Expires\nDescription\nThis cookie is set by the Google recaptcha service to identify bots to protect the website against malicious spam attacks.\nCookie\nrc::c\nDuration\nsession\nDescription\nThis cookie is set by the Google recaptcha service to identify bots to protect the website against malicious spam attacks.\nCookie\nvisid_incap_*\nDuration\n1 year\nDescription\nIncapsula sets this cookie to provide cloud-based website security services.\nCookie\nnlbi_*\nDuration\nsession\nDescription\nThe Hotels Network sets this cookie to improve security and provide load-balancing to ensure that a client's requests are sent to the same origin server.\nCookie\nincap_ses_*\nDuration\nsession\nDescription\nThis is an Incapsula DDoS Protection and Web Application Firewall cookie that is used to relate HTTP requests to a certain session.\nCookie\n_GRECAPTCHA\nDuration\n6 months\nDescription\nGoogle Recaptcha service sets this cookie to identify bots to protect the website against malicious spam attacks.\nCookie\nrc::f\nDuration\nNever Expires\nDescription\nThis cookie is set by the Google recaptcha service to identify bots to protect the website against malicious spam attacks.\nCookie\nrc::b\nDuration\nsession\nDescription\nThis cookie is set by the Google recaptcha service to identify bots to protect the website against malicious spam attacks.\nCookie\nJSESSIONID\nDuration\nsession\nDescription\nNew Relic uses this cookie to store a session identifier so that New Relic can monitor session counts for an application.\nCookie\n__hssrc\nDuration\nsession\nDescription\nThis cookie is set by Hubspot whenever it changes the session cookie. The __hssrc cookie set to 1 indicates that the user has restarted the browser, and if the cookie does not exist, it is assumed to be a new session.\nCookie\n__hssc\nDuration\n1 hour\nDescription\nHubSpot sets this cookie to keep track of sessions and to determine if HubSpot should increment the session number and timestamps in the __hstc cookie.\nCookie\ncookieyes-consent\nDuration\n1 year\nDescription\nCookieYes sets this cookie to remember users' consent preferences so that their preferences are respected on subsequent visits to this site. It does not collect or store any personal information about the site visitors.\nFunctional cookies help perform certain functionalities like sharing the content of the website on social media platforms, collecting feedback, and other third-party features.\nCookie\nlang\nDuration\nsession\nDescription\nLinkedIn sets this cookie to remember a user's language setting.\nCookie\nli_gc\nDuration\n6 months\nDescription\nLinkedin set this cookie for storing visitor's consent regarding using cookies for non-essential purposes.\nCookie\nlidc\nDuration\n1 day\nDescription\nLinkedIn sets the lidc cookie to facilitate data center selection.\nCookie\nyt-remote-device-id\nDuration\nNever Expires\nDescription\nYouTube sets this cookie to store the user's video preferences using embedded YouTube videos.\nCookie\nytidb::LAST_RESULT_ENTRY_KEY\nDuration\nNever Expires\nDescription\nThe cookie ytidb::LAST_RESULT_ENTRY_KEY is used by YouTube to store the last search result entry that was clicked by the user. This information is used to improve the user experience by providing more relevant search results in the future.\nCookie\nyt-remote-connected-devices\nDuration\nNever Expires\nDescription\nYouTube sets this cookie to store the user's video preferences using embedded YouTube videos.\nCookie\nyt-remote-session-app\nDuration\nsession\nDescription\nThe yt-remote-session-app cookie is used by YouTube to store user preferences and information about the interface of the embedded YouTube video player.\nCookie\nyt-remote-cast-installed\nDuration\nsession\nDescription\nThe yt-remote-cast-installed cookie is used to store the user's video player preferences using embedded YouTube video.\nCookie\nyt-remote-session-name\nDuration\nsession\nDescription\nThe yt-remote-session-name cookie is used by YouTube to store the user's video player preferences using embedded YouTube video.\nCookie\nyt-remote-fast-check-period\nDuration\nsession\nDescription\nThe yt-remote-fast-check-period cookie is used by YouTube to store the user's video player preferences for embedded YouTube videos.\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics such as the number of visitors, bounce rate, traffic source, etc.\nCookie\n_gcl_au\nDuration\n3 months\nDescription\nGoogle Tag Manager sets the cookie to experiment advertisement efficiency of websites using their services.\nCookie\n_ga_*\nDuration\n1 year 1 month 4 days\nDescription\nGoogle Analytics sets this cookie to store and count page views.\nCookie\n_ga\nDuration\n1 year 1 month 4 days\nDescription\nGoogle Analytics sets this cookie to calculate visitor, session and campaign data and track site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognise unique visitors.\nCookie\n_hjSessionUser_*\nDuration\n1 year\nDescription\nHotjar sets this cookie to ensure data from subsequent visits to the same site is attributed to the same user ID, which persists in the Hotjar User ID, which is unique to that site.\nCookie\n_hjSession_*\nDuration\n1 hour\nDescription\nHotjar sets this cookie to ensure data from subsequent visits to the same site is attributed to the same user ID, which persists in the Hotjar User ID, which is unique to that site.\nCookie\n__hstc\nDuration\n6 months\nDescription\nHubspot set this main cookie for tracking visitors. It contains the domain, initial timestamp (first visit), last timestamp (last visit), current timestamp (this visit), and session number (increments for each subsequent session).\nCookie\nhubspotutk\nDuration\n6 months\nDescription\nHubSpot sets this cookie to keep track of the visitors to the website. This cookie is passed to HubSpot on form submission and used when deduplicating contacts.\nCookie\n_hjTLDTest\nDuration\nsession\nDescription\nTo determine the most generic cookie path that has to be used instead of the page hostname, Hotjar sets the _hjTLDTest cookie to store different URL substring alternatives until it fails.\nPerformance cookies are used to understand and analyse the key performance indexes of the website which helps in delivering a better user experience for the visitors.\nNo cookies to display.\nAdvertisement cookies are used to provide visitors with customised advertisements based on the pages you visited previously and to analyse the effectiveness of the ad campaigns.\nCookie\nbcookie\nDuration\n1 year\nDescription\nLinkedIn sets this cookie from LinkedIn share buttons and ad tags to recognize browser IDs.\nCookie\nbscookie\nDuration\n1 year\nDescription\nLinkedIn sets this cookie to store performed actions on the website.\nCookie\nYSC\nDuration\nsession\nDescription\nYoutube sets this cookie to track the views of embedded videos on Youtube pages.\nCookie\nVISITOR_INFO1_LIVE\nDuration\n6 months\nDescription\nYouTube sets this cookie to measure bandwidth, determining whether the user gets the new or old player interface.\nCookie\nVISITOR_PRIVACY_METADATA\nDuration\n6 months\nDescription\nYouTube sets this cookie to store the user's cookie consent state for the current domain.\nPowered by\nCross River Logo\nProducts\nInfrastructure\nBank Rails\nStablecoin Payments\nACH\nWires\nFedNow®\nCRNow\nRTP®\nInternational Payments\nCard Issuing & Processing\nDebit\nCredit\nPrepaid\nProcessing\nDigital Lending\nLoan Origination\nSecond-Look Programs\nCard Payments\nAcquiring BIN Sponsorship\nPush-to-Card\nPull-from-Card\nAccounts\nChecking\nSavings\nCapital Solutions\nPrincipal Financing\nCredit Facilities\nSeasoning Facilities\nLoan Retention\nLoan Purchases\nCRB Securities\nInvestment Banking\nStructured Products\nSolutions\nCrypto Solutions\nNeobanks\nDigital Lenders\nMerchant Acquirers\nGaming Industry\nInstitutional Credit Investors\nDevelopers\nCOS\nDocumentation\nBanking\nCommercial Lending\nCommercial Real Estate\nConstruction Lending\nLender Finance\nHealthcare Finance\nSmall Business Lending\nCompany\nInsights\nNewsroom\nWhy Cross River\nGiving Back\nLogin\nHigh-Yield CD\nBranch Customers\nDigital Business Banking\nContact Sales\nCareers\nApply Now\nJoin us as we build the future of finance together.\nSubscribe to Cross River\nReceive updates on events, thought leadership, product developments and more\nEmail\n*\nBy submitting your email address, you agree for us to contact you and to our\nPrivacy Policy\n. You may unsubscribe from our communications at any time by\nclicking here\n.\nOverview\nAbout Us\nCareers\nNewsroom\nDigital Ventures\nFoundation@\nFAQs\nSupport\nProducts and Services\nFintech Banking\nCommercial Real Estate\nConstruction Lending\nLender Finance\nHealthcare Finance\nSmall Business Lending\nPersonal Banking\nBusiness Banking\nBranches\nDevelopers\nSandbox\nAPIs\nLibrary\nPrivacy Policy\nPrivacy Notice\nFederal Deposit Insurance Corporation (FDIC)\nEqual Housing Lender\nHeter Iska\nAccessibility\nRegulation E Protections\nBusiness Security\nCode of Conduct\nConsumer Security\nCustomer Notice\nMortgage Servicing\nPaycheck Protection Program (PPP)\nCopyright\n©\n2026 Cross River Bank | Member FDIC | Equal Housing Lender | All Rights Reserved"
  },
  {
    "title": "Enterprise Solutions Architect, Expense",
    "company_name": "Navan",
    "company_stage": "Growth",
    "location": "New York, NY, Palo Alto, CA, San Francisco, CA",
    "industry": "Consumer",
    "category": "Sales",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$172,800 - $216,000",
    "description_url": "https://navan.com/careers/openings?gh_jid=7522116",
    "required_skills": [
      "Month End Close",
      "Finance",
      "Solution Architecture",
      "Sales Compensation",
      "CPA",
      "Audit"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Enterprise Solutions Architect, Expense\nNavan - Business Travel Solutions & Expense Management\nNavan - Business Travel Solutions & Expense Management\nPlatform\nTravel\nBusiness Travel Management\nSee how to manage all corporate travel in one place.\nProgram Management\nAdvanced Analytics\nNavan Rewards\nSustainability\nTravel Services\nSupport\nPersonal Travel\nExpense\nPayments\nBusiness Travel Management\nSee how to manage all corporate travel in one place.\nProgram Management\nTravel Services\nAdvanced Analytics\nNavan Rewards\nSustainability\nSupport\nPersonal Travel\nExpense Management\nControl, manage, and track expenses.\nPayments\nUse Navan cards or bring your own corporate card.\nIntegrations\nSecurity & Trust\nNavan Cognition\nSolutions\nBy Role\nAccounting Teams\nExecutive Assistants\nFinance Teams\nTravel Managers\nTravelers\nBy Company Size\nEnterprises\nSmall Businesses\nBy Industry\nEnergy and Utilities\nFinancial Services\nFood and Beverage\nHealth and Wellness\nIndustrial and Manufacturing\nMedia and Entertainment\nProfessional Services\nReal Estate & Construction\nRetail and E-Commerce\nTechnology and Software\nNavan leads G2’s fall 2025 rankings\nRead now\nPricing\nResources\nResource Center\nWebinars\nGuides and Reports\nBlogs\nPer Diem Calculator\nMileage Calculator\nGlossary\nDiscover exclusive data from Navan and Nasdaq experts\nRead now\nCustomers\nCase Studies\nCustomer Reviews\nAdmin resources\nEnd-User Resources\nHelp Center\nCompany\nAbout Us\nPartners\nInvestor Relations\nCareers\nContact Us\nJoin our team\nView job openings\nRegion\nFrance\nGermany\nNetherlands\nSpain\nUnited Kingdom\nUnited States\nGet started\nRequest a demo\nLog In\nFrance\nGermany\nNetherlands\nSpain\nUnited Kingdom\nUnited States\nLog In\nGet started\nLog In\nEnterprise Solutions Architect, Expense\nLocation:\nNew York, NY; Palo Alto, CA or San Francisco, CA\nDepartment:\nSales\nNavan Expense is an expense management solution that eliminates the traditional hassles of an expense reporting process while giving accounting and finance leaders real-time spend visibility and control. Navan Expense provides employees with a refreshingly easy way to pay for what they need while giving accounting and finance leaders one easy place to control, manage, and track spend. With the ability to issue physical and virtual cards, ingest existing corporate card programs, support reimbursements, globally, smart policy management, and automated expensing, Navan Expense streamlines the entire business spending process — driving cost-savings, productivity, and compliance.\nNavan is looking for an\nEnterprise Solutions Architect, Expense\nto join our hyper-growth, global revenue team. This individual can choose to sit in our New York, Austin, or San Francisco office!  As an Enterprise Solutions Architect, Expense, you will be a key player in helping Account Executives sell the Navan Expense product offerings to net new and existing customers within the Enterprise market segment by combining your expertise of accounting and finance with your knowledge of our expense management platform. Navan Expense has currently seen 10x growth in the last year and is currently being used by 3,000+ companies, such as Epicor, Amplitude, Loom, Toast & Lyft. By understanding client needs and leveraging your knowledge, you will help assist with an effective strategy that will ultimately drive revenue.\nThe Ideal Candidate will be a subject matter expert with an accounting and finance background who is looking to be a leader of their career as they become the foundation of an expanding team while joining a global, multi-product, multi-market SaaS company.\nAs an Enterprise Solutions Architect, Expense, you will:\nMaster and articulate\nthe compelling value proposition of Navan Expense, becoming the go-to expert for its capabilities and benefits.\nCultivate deep industry expertise\nwithin Travel and Expense Management, enabling you to strategically position Navan Expense and its features to address specific client challenges and drive significant business value.\nEmpower the Enterprise Account Executive Organization\nby delivering impactful training and ongoing education on the strategic value and product capabilities of Navan Expense.\nEngage strategically with prospective clients\nthroughout the sales cycle, delivering compelling presentations and tailored demonstrations that showcase how Navan Expense directly addresses their unique payment and expense management requirements.\nCollaborate cross-functionally\nwith Sales Enablement, Product, and Implementation teams, actively channeling product feedback to shape future innovation and ensure seamless customer experiences.\nSeize opportunities for professional growth\nand contribute to the exciting trajectory of our rapidly expanding Navan Expense division, capitalizing on the 10x revenue growth achieved in the last fiscal year.\nWhat We’re Looking For:\n2+ years experience as an Audit Associate/Senior Associate at a Big Four firm\n6+ years Accounting/Finance experience\n2+ years Month-end close experience\nExperience working with C-Level executives at 3,000+ person companies\nAbility to function in a “Player/Coach” capacity\nCPA, MAcc, or MBA\nThe posted pay range represents the anticipated low and high end of the compensation for this position and is subject to change based on business need. To determine a successful candidate’s starting pay, we carefully consider a variety of factors, including primary work location, an evaluation of the candidate’s skills and experience, market demands, and internal parity.\nFor roles with on-target-earnings (OTE), the pay range includes both base salary and target incentive compensation. Target incentive compensation for some roles may include a ramping draw period. Compensation is higher for those who exceed targets. Candidates may receive more information from the recruiter.\nPay Range\n$172,800\n—\n$216,000 USD\nAbout Navan\nNavan is the leading all-in-one\nbusiness travel\nand\nexpense management\nsolution that makes travel easy for frequent travelers. From finding flights and hotels, to automating expense reconciliation, with 24/7 support along the way, Navan delivers an intuitive experience travelers love and finance teams rely on.\nSee how Navan customers benefit\nand learn more at\nnavan.com\n.\nOur Benefits\nNavan provides a comprehensive benefits package tailored to support your well-being and financial security. Our offerings include generous medical plans, dental, and vision benefits with premiums covered by Navan, as well as various insurance options designed to cover each family's needs. We also prioritize your holistic wellness with perks like paid parental and bereavement leave, subsidized commuter benefits, mental health support, connectivity stipends, and even pet insurance.\nWorkplace Policy\nNavan believes in the value of in-person connections, whether that is sitting down to have lunch with one another, taking a walking 1:1, or collaborating in a room together. The connections forged through face-to-face interactions improve company culture and drive business results. Navan invests in global office spaces — in the U.S., Europe, and Asia, among others — that feel welcoming. Perks such as lunches and happy hours create a strong team environment to help you do your best work. We prioritize in-person connections and operate on a four-day-in-office work model. Please expect this policy for all roles that are tied to an office.\nEqual Opportunity\nNavan is an equal opportunity employer. We make all employment decisions based solely on merit. We provide equal employment opportunity to all applicants and employees without discrimination on the bases of race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We prohibit any such discrimination or harassment. This policy applies to all terms and conditions of employment, including hiring.\nAccommodations\nNavan complies with the Americans with Disabilities Act (ADA), as amended by the ADA Amendments Act, and all applicable state or local law. Navan will reasonably accommodate qualified individuals with a disability in connection with applications for employment as required by law.\nIf you need any assistance or accommodations due to a disability, you are welcome to email us at\ntalent-accommodations@navan.com\n.\nCandidate Privacy Notice\nPlease review Navan's Candidate Privacy Notice\nhere\n.\nJob Search Best Practices\nWe have been made aware of recruitment scams involving fraudulent attempts\nto lure job seekers into sending money or personal information in return\nfor fake job offers or coerce them into purchasing equipment by electronic\nfunds transfer (Zelle, Venmo, etc.) Legitimate Navan recruiters will never\nask for money in any recruitment or onboarding activities. All available job openings at Navan will be posted on Navan’s website and all Navan recruiters will be reachable through an email address ending in “@navan.com” or “@navan.tech” or \"@talent.navan.com\".\nBusiness Travel\nExpense Management\nAdvanced Analytics\nNavan Rewards\nSustainability\nEnterprises\nSmall Business\nAccounting Teams\nExecutive Assistants\nFinance Teams\nTravel Managers\nTravelers\nEnergy and Utilities\nFinancial Services\nFood and Beverages\nHealth and Wellness\nIndustrial and Manufacturing\nMedia and Entertainment\nProfessional Services\nReal Estate and Construction\nRetail and Ecommerce\nTechnology and Software\nGuides\nCompare Us\nBlog\nTravel and Expense Glossary\nPer Diem Calculator\nMileage Calculator\nCase Studies\nHelp Center\nCustomer Resources\nEnd-User Resources\nCustomer Reviews\nAbout Us\nPress Center\nPartners\nCareers\nContact Us\n4.7\nout of\n5\n|\n8.5K+\nreviews\nreturn (\n);\nFrance\nGermany\nNetherlands\nSpain\nUnited Kingdom\nUnited States\nWebsite Terms of Use\nPrivacy\nSecurity\nAccessibility Statement\nModern Slavery Statement\nStatus\n©\n2026\nNavan\nThe Navan card is issued by Celtic Bank (Member FDIC), Stripe Technology Europe Limited, Stripe Payments UK Limited, Adyen N.V. (EU), Adyen N.V. San Francisco Branch (US), and Adyen N.V. London Branch (UK)\nAbout Navan\nNavan is the leading all-in-one\nbusiness travel\nand\nexpense management\nplatform, powering travel programs at more than 10,000 companies, including\nCanva\n,\nHelloFresh\n, DoorDash,\nDuolingo\n, and Steelcase. The platform simplifies travel, payments, and expense management with intuitive tools for booking, automated payments with built-in virtual cards, and seamless expense reporting. Navan delivers\nexceptional customer satisfaction\n, with a 96% CSAT and 43 NPS. Founded in 2015 by Ariel Cohen and Ilan Twig as TripActions, Navan reported $613M in LTM revenue and $7.6B in LTM gross booking volume, each for the twelve months ended July 31, 2025. The company aims to empower organizations worldwide to make corporate travel smarter and more efficient. Learn more at\nnavan.com\n.\nBusiness Travel\nExpense Management\nAdvanced Analytics\nNavan Rewards\nSustainability\nEnterprises\nSmall Business\nAccounting Teams\nExecutive Assistants\nFinance Teams\nTravel Managers\nTravelers\nEnergy and Utilities\nFinancial Services\nFood and Beverages\nHealth and Wellness\nIndustrial and Manufacturing\nMedia and Entertainment\nProfessional Services\nReal Estate and Construction\nRetail and Ecommerce\nTechnology and Software\nGuides\nCompare Us\nBlog\nTravel and Expense Glossary\nPer Diem Calculator\nMileage Calculator\nCase Studies\nHelp Center\nCustomer Resources\nEnd-User Resources\nCustomer Reviews\nAbout Us\nPress Center\nPartners\nCareers\nContact Us\n4.7\nout of\n5\n|\n8.5K+\nreviews\nreturn (\n);\nFrance\nGermany\nNetherlands\nSpain\nUnited Kingdom\nUnited States\nWebsite Terms of Use\nPrivacy\nSecurity\nAccessibility Statement\nModern Slavery Statement\nStatus\n©\n2026\nNavan\nThe Navan card is issued by Celtic Bank (Member FDIC), Stripe Technology Europe Limited, Stripe Payments UK Limited, Adyen N.V. (EU), Adyen N.V. San Francisco Branch (US), and Adyen N.V. London Branch (UK)\nAbout Navan\nNavan is the leading all-in-one\nbusiness travel\nand\nexpense management\nplatform, powering travel programs at more than 10,000 companies, including\nCanva\n,\nHelloFresh\n, DoorDash,\nDuolingo\n, and Steelcase. The platform simplifies travel, payments, and expense management with intuitive tools for booking, automated payments with built-in virtual cards, and seamless expense reporting. Navan delivers\nexceptional customer satisfaction\n, with a 96% CSAT and 43 NPS. Founded in 2015 by Ariel Cohen and Ilan Twig as TripActions, Navan reported $613M in LTM revenue and $7.6B in LTM gross booking volume, each for the twelve months ended July 31, 2025. The company aims to empower organizations worldwide to make corporate travel smarter and more efficient. Learn more at\nnavan.com\n.\nYour Opt Out Preference Signal is Honored\nPrivacy Preference Center\nWe value your privacy. We use cookies for a variety of purposes including advertising and to learn about how you interact on our website. Some of these cookies are considered a “sale” and “sharing” under the California Privacy Rights Act (CPRA) or targeted advertising. As such, you can opt-out of third party advertising and tracking cookies that are not considered service providers by turning off these cookies below or by broadcasting the global privacy control signal on a browser/extension that supports it. \n\nPlease note that if you visit our website from a different computer or device or clear your cookies from your browser, you will need to provide your preferences again.\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese strictly necessary cookies allow you access to our website and services, applications, and tools. They are used for essential purposes such as identifying irregular website behavior, preventing fraudulent activity and improving security.\nSale of Personal Data\nSale of Personal Data\nUnder the California Consumer Privacy Act, you have the right to opt-out of the sale of your personal information to third parties. These cookies collect information for analytics and to personalize your experience with targeted ads. You may exercise your right to opt out of the sale of personal information by using this toggle switch.\n                If you opt out we will not be able to offer you personalised ads and will not hand over your personal information to any third parties. Additionally, you may contact our legal department for further clarification about your rights as a California consumer by using this Exercise My Rights link. If you have enabled privacy controls on your browser (such as a plugin), we have to take that as a valid request to opt-out. Therefore we would not be able to track your activity through the web. This may affect our ability to personalize ads according to your preferences.\nTargeting Cookies\nSwitch Label\nlabel\nThese cookies allow us to deliver content, including ads relevant to your interests, on our website/services or on third-party sites.\nAnalytics Cookies\nAnalytics Cookies\nAnalytics cookies collect information about your use of the Site and enable us to improve the way it works. For example, analytics cookies show us which are the most frequently visited pages on the Site, help us record any difficulties you have with the Site, and show us whether our advertising is effective or not. This allows us to see the overall patterns of usage on the Site, rather than the usage of a single person. We use the information to analyze Site traffic, but we do not examine this information for individually identifying information.\nPerformance Cookies\nPerformance Cookies\nThese cookies help us assess the performance of our website and services, including as part of our analytics practices to help us understand how individuals use the website/services.\nFunctional Cookies\nFunctional Cookies\nThese cookies allow us to offer you enhanced functionality when using the website and services. The cookies collect information about your choices and preferences and allow us to remember language or other local settings and customize the Site accordingly.\nCookie List\nSearch Icon\ncheckbox label\nlabel\nConsent\nLeg.Interest\ncheckbox label\nlabel\ncheckbox label\nlabel\ncheckbox label\nlabel"
  },
  {
    "title": "Senior Systems Automation Engineer",
    "company_name": "Omada Health",
    "company_stage": "Growth",
    "location": "Remote, USA",
    "industry": "Bio + Health",
    "category": "Operations",
    "experience_level": "Senior",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$142,600 - $178,300",
    "description_url": "https://job-boards.greenhouse.io/omadahealth/jobs/7415707",
    "required_skills": [
      "Orchestration",
      "Change Management",
      "Diabetes",
      "Product Requirements",
      "HIPAA",
      "Okta",
      "Hypertension",
      "REST",
      "Systems Engineering",
      "Python",
      "Mentorship",
      "Process Flow Documentation",
      "Workato",
      "System Integration",
      "Finance",
      "Process Improvement",
      "State & Local",
      "Grant Writing",
      "Automation",
      "Audit",
      "API Integrations",
      "Equity",
      "Privacy",
      "SCIM",
      "Automation Systems",
      "Software as a Service",
      "Governance",
      "Observability",
      "Workflow Scheduling",
      "PBM",
      "Artificial Intelligence",
      "Technical Support",
      "SOX",
      "JSON",
      "Good Lab Practice",
      "Scripting"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Job Application for Senior Systems Automation Engineer at Omada Health\nBack to jobs\nNew\nSenior Systems Automation Engineer\nRemote, USA\nOmada Health is on a mission to inspire and engage people in lifelong health, one step at a time. The Omada IT department builds and operates resilient, scalable services that empower all of Omada.\nJob Overview:\nThe Senior Automation (Systems) Engineer is a senior individual contributor responsible for designing, building, and delivering high-impact automations across Omada’s internal systems ecosystem. This role blends workflow automation, system integration, AI-supported decisioning, and process design to solve complex operational challenges.\nYou will work across the organization—including People & Culture, Recruiting, Finance, Care Delivery, Support, Security, and Engineering—to identify automation opportunities, translate abstract requirements into scalable technical designs, and execute end-to-end delivery.\nIn this role, you are expected to operate with a high degree of autonomy, apply strong technical depth, and consistently produce secure, resilient, and well-designed automations that scale with the business. You will influence the quality of our automation ecosystem through craftsmanship and adherence to standards, without owning team-level frameworks or mentoring responsibilities.\nIntake, Discovery & Solution Analysis:\nParticipate in the intake process by clarifying requirements, gathering context, and translating problem statements into structured technical scopes.\nAssess automation requests against established prioritization criteria—including expected ROI, operational impact, compliance relevance, and alignment with automation standards—to ensure the team focuses on the highest-value opportunities.\nEvaluate technical feasibility, system dependencies, and potential risks of proposed automations to support effective prioritization and planning.\nDeconstruct ambiguous, multi-step processes into clear workflow models that inform design and implementation decisions.\nIdentify risks, edge cases, and downstream impacts early and surface them to the Automation Manager as part of the discovery cycle.\nDesign, Build & Implementation:\nTranslate requirements and PRDs into detailed automation designs across platforms such as Tines, n8n, and API-driven workflows.\nBuild automations that adhere to existing security, reliability, observability, and AI governance standards.\nIntegrate SaaS platforms using REST APIs, webhooks, event-driven triggers, and structured JSON payloads.\nIterate rapidly on prototypes, validating logic and refining flows to ensure stability, performance, and alignment with business rules.\nEnsure all build artifacts—logic flows, decision models, error handling, and dependency maps—are well-documented and auditable.\nCoordinate with Engineering when custom APIs or technical support is required for automation execution.\nPerform structured UAT with stakeholders, incorporating feedback and ensuring readiness for deployment through change management processes.\nLaunch, Maintenance & Operations:\nOwn the full lifecycle of automation deployments, including testing, launch, hypercare, tuning, and steady-state stabilization.\nMaintain, optimize, and refactor automations as upstream systems evolve or new business requirements emerge.\nEnsure automations are built to be inheritable and understandable, with documentation aligned to standards for long-term maintainability.\nMonitor performance and troubleshoot issues, proactively implementing improvements that enhance reliability and reduce operational burden.\nCross-functional Partnership & Collaboration:\nPartner with stakeholders across Omada—including P&C, Recruiting, Finance, Care Delivery, Security, Compliance, and Engineering—to understand workflows, challenges, and downstream impacts.\nWork closely with EPD (Engineering, Product, and Design) on automation-related projects, ensuring alignment on technical dependencies, integration points, API behaviors, and system constraints to deliver reliable, scalable solutions.\nProvide technical consultation on automation feasibility, integration complexity, and required process adjustments.\nWork with team members to ensure automations align with standards for change management, data governance, and audit readiness.\nContribute to an automation-as-a-service model by building solutions that leverage reusable logic and consistent design patterns.\nWhat Great Looks Like:\nQuickly understands complex processes, identifies inefficiencies, and executes solutions that deliver measurable value.\nDelivers high-quality automation designs that are resilient, well-documented, and aligned with security and governance standards.\nExercises strong technical judgment, knowing when to keep solutions simple and when robust workflows are required.\nOperates with high autonomy, managing full lifecycle delivery of automations with minimal oversight.\nBuilds trust with cross-functional partners through clarity, predictability, and consistent execution.\nIncorporates compliance and auditability into design decisions, aligning with SOX, HIPAA, and security requirements.\nImproves team velocity by producing inheritable workflows and documentation others can easily support.\nConsistently demonstrates senior-level ownership by delivering high-quality solutions independently and driving meaningful cross-functional impact through technical depth and reliable execution.\nCandidate Requirements:\n7+ years of hands-on experience in systems automation, systems engineering, or multi-system workflow integration.\nStrong technical understanding of REST APIs, webhooks, event-driven integrations, and structured JSON.\nProven ability to deconstruct complex business processes into structured workflow models and technical designs.\nHands-on experience building secure, resilient automations in at least one orchestration platform (Tines strongly preferred).\nExperience conducting UAT, validating edge cases, and participating in formal change management processes.\nStrong documentation skills, including workflow diagrams, decision matrices, and technical specifications.\nFamiliarity with AI-assisted decisioning workflows, including LLM prompt design, routing logic, and scenario handling.\nExposure to identity lifecycle automation (Okta, Workday, SCIM provisioning, and attribute-based access approaches such as ABAC).\nDemonstrated Business Process Analysis or process redesign experience applied to cross-functional workflows.\nAbility to write and maintain scripting (Python) for API integrations, data transformations, or workflow logic.\nAbility to operate autonomously in a fast-paced environment while managing multiple concurrent automation projects.\nStrong communication and partnership skills, with the ability to collaborate effectively across technical and non-technical teams.\nNice-to-Haves:\nExperience with additional automation platforms (n8n, Workato, Zapier, or equivalent).\nExperience in SOX, HIPAA, or other audit-aligned environments.\nExposure to monitoring, observability, or logging tooling supporting automation reliability.\nBenefits:\nCompetitive salary with generous annual cash bonus\nEquity Grants\nRemote first work from home culture\nFlexible vacation to help you rest, recharge, and connect with loved ones\nGenerous parental leave\nHealth, dental, and vision insurance (and above market employer contributions)\n401k retirement savings plan\nLifestyle Spending Account (LSA)\nMental Health Support Solutions\n...and more!\nIt takes a village to change health care. As we build together toward our mission, we strive to embody the following values in our day-to-day work. We hope these hold meaning for you as well as you consider Omada!\nCultivate Trust.\nWe actively cultivate trust through attentive listening and supporting one another. We respectfully provide and are open to receiving candid feedback.\nSeek Context.\nWe ask to understand and we build connections. We do our research up front to move faster down the road.\nAct Boldly.\nWe innovate daily to solve problems, improve processes, and find new opportunities for our members and customers.\nDeliver Results.\nWe reward impact above output. We set a high bar, we’re not afraid to fail, and we take pride in our work.\nSucceed Together.\nWe prioritize Omada’s progress above team or individual. We have fun as we get stuff done, and we celebrate together.\nRemember Why We’re Here.\nWe push through the challenges of changing health care because we know the destination is worth it.\nAbout Omada Health:\nOmada Health\nis a between-visit healthcare provider that addresses lifestyle and behavior change elements for individuals managing chronic conditions. Omada’s multi-condition platform treats diabetes, hypertension, prediabetes, musculoskeletal, and GLP-1 management. With insights from connected devices and AI-supported tools, Omada care teams deliver care that is rooted in evidence and unique to every member, unlocking results at scale. With more than a decade of experience and data, and 29 peer-reviewed publications showcasing clinical and economic proof points, Omada’s approach is designed to improve health outcomes and contain costs. Our customers include health plans, pharmacy benefit managers, health systems, and employers ranging from small businesses to Fortune 500s. At Omada, we aim to inspire and empower people to make lasting health changes on their own terms. For more information, visit:\nhttps://www.omadahealth.com/\nOmada is thrilled to share that we’ve been certified as a Great Place to Work! Please\nclick here\nfor more information.\nWe carefully hire the best talent we can find, which means actively seeking diversity of beliefs, backgrounds, education, and ways of thinking. We strive to build an inclusive culture where differences are celebrated and leveraged to inform better design and business decisions. Omada is proud to be an equal opportunity workplace and affirmative action employer. We are committed to equal opportunity regardless of race, color, religion, sex, gender identity, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, domestic partner status, sexual orientation, or any other basis protected by local, state, or federal laws.\nBelow is a summary of salary ranges for this role in the following geographies:\nCalifornia, New York State and Washington State Base Compensation Ranges: $142,600 - $178,300*, Colorado Base Compensation Ranges: $136,400 - $170,500*. Other states may vary.\nThis role is also eligible for participation in annual cash bonus and equity grants.\n*The actual offer, including the compensation package, is determined based on multiple factors, such as the candidate's skills and experience, and other business considerations.\nPlease\nclick here\nfor more information on our Candidate Privacy Notice.\nCreate a Job Alert\nInterested in building your career at Omada Health? Get future opportunities sent straight to your email.\nCreate alert\nApply for this job\n*\nindicates a required field\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\nCountry\n*\nPhone\n*\n244 results found\nNo results found\nAfghanistan\n+93\nÅland Islands\n+358\nAlbania\n+355\nAlgeria\n+213\nAmerican Samoa\n+1\nAndorra\n+376\nAngola\n+244\nAnguilla\n+1\nAntigua & Barbuda\n+1\nArgentina\n+54\nArmenia\n+374\nAruba\n+297\nAscension Island\n+247\nAustralia\n+61\nAustria\n+43\nAzerbaijan\n+994\nBahamas\n+1\nBahrain\n+973\nBangladesh\n+880\nBarbados\n+1\nBelarus\n+375\nBelgium\n+32\nBelize\n+501\nBenin\n+229\nBermuda\n+1\nBhutan\n+975\nBolivia\n+591\nBosnia & Herzegovina\n+387\nBotswana\n+267\nBrazil\n+55\nBritish Indian Ocean Territory\n+246\nBritish Virgin Islands\n+1\nBrunei\n+673\nBulgaria\n+359\nBurkina Faso\n+226\nBurundi\n+257\nCambodia\n+855\nCameroon\n+237\nCanada\n+1\nCape Verde\n+238\nCaribbean Netherlands\n+599\nCayman Islands\n+1\nCentral African Republic\n+236\nChad\n+235\nChile\n+56\nChina\n+86\nChristmas Island\n+61\nCocos (Keeling) Islands\n+61\nColombia\n+57\nComoros\n+269\nCongo - Brazzaville\n+242\nCongo - Kinshasa\n+243\nCook Islands\n+682\nCosta Rica\n+506\nCôte d’Ivoire\n+225\nCroatia\n+385\nCuba\n+53\nCuraçao\n+599\nCyprus\n+357\nCzechia\n+420\nDenmark\n+45\nDjibouti\n+253\nDominica\n+1\nDominican Republic\n+1\nEcuador\n+593\nEgypt\n+20\nEl Salvador\n+503\nEquatorial Guinea\n+240\nEritrea\n+291\nEstonia\n+372\nEswatini\n+268\nEthiopia\n+251\nFalkland Islands\n+500\nFaroe Islands\n+298\nFiji\n+679\nFinland\n+358\nFrance\n+33\nFrench Guiana\n+594\nFrench Polynesia\n+689\nGabon\n+241\nGambia\n+220\nGeorgia\n+995\nGermany\n+49\nGhana\n+233\nGibraltar\n+350\nGreece\n+30\nGreenland\n+299\nGrenada\n+1\nGuadeloupe\n+590\nGuam\n+1\nGuatemala\n+502\nGuernsey\n+44\nGuinea\n+224\nGuinea-Bissau\n+245\nGuyana\n+592\nHaiti\n+509\nHonduras\n+504\nHong Kong SAR China\n+852\nHungary\n+36\nIceland\n+354\nIndia\n+91\nIndonesia\n+62\nIran\n+98\nIraq\n+964\nIreland\n+353\nIsle of Man\n+44\nIsrael\n+972\nItaly\n+39\nJamaica\n+1\nJapan\n+81\nJersey\n+44\nJordan\n+962\nKazakhstan\n+7\nKenya\n+254\nKiribati\n+686\nKosovo\n+383\nKuwait\n+965\nKyrgyzstan\n+996\nLaos\n+856\nLatvia\n+371\nLebanon\n+961\nLesotho\n+266\nLiberia\n+231\nLibya\n+218\nLiechtenstein\n+423\nLithuania\n+370\nLuxembourg\n+352\nMacao SAR China\n+853\nMadagascar\n+261\nMalawi\n+265\nMalaysia\n+60\nMaldives\n+960\nMali\n+223\nMalta\n+356\nMarshall Islands\n+692\nMartinique\n+596\nMauritania\n+222\nMauritius\n+230\nMayotte\n+262\nMexico\n+52\nMicronesia\n+691\nMoldova\n+373\nMonaco\n+377\nMongolia\n+976\nMontenegro\n+382\nMontserrat\n+1\nMorocco\n+212\nMozambique\n+258\nMyanmar (Burma)\n+95\nNamibia\n+264\nNauru\n+674\nNepal\n+977\nNetherlands\n+31\nNew Caledonia\n+687\nNew Zealand\n+64\nNicaragua\n+505\nNiger\n+227\nNigeria\n+234\nNiue\n+683\nNorfolk Island\n+672\nNorth Korea\n+850\nNorth Macedonia\n+389\nNorthern Mariana Islands\n+1\nNorway\n+47\nOman\n+968\nPakistan\n+92\nPalau\n+680\nPalestinian Territories\n+970\nPanama\n+507\nPapua New Guinea\n+675\nParaguay\n+595\nPeru\n+51\nPhilippines\n+63\nPoland\n+48\nPortugal\n+351\nPuerto Rico\n+1\nQatar\n+974\nRéunion\n+262\nRomania\n+40\nRussia\n+7\nRwanda\n+250\nSamoa\n+685\nSan Marino\n+378\nSão Tomé & Príncipe\n+239\nSaudi Arabia\n+966\nSenegal\n+221\nSerbia\n+381\nSeychelles\n+248\nSierra Leone\n+232\nSingapore\n+65\nSint Maarten\n+1\nSlovakia\n+421\nSlovenia\n+386\nSolomon Islands\n+677\nSomalia\n+252\nSouth Africa\n+27\nSouth Korea\n+82\nSouth Sudan\n+211\nSpain\n+34\nSri Lanka\n+94\nSt. Barthélemy\n+590\nSt. Helena\n+290\nSt. Kitts & Nevis\n+1\nSt. Lucia\n+1\nSt. Martin\n+590\nSt. Pierre & Miquelon\n+508\nSt. Vincent & Grenadines\n+1\nSudan\n+249\nSuriname\n+597\nSvalbard & Jan Mayen\n+47\nSweden\n+46\nSwitzerland\n+41\nSyria\n+963\nTaiwan\n+886\nTajikistan\n+992\nTanzania\n+255\nThailand\n+66\nTimor-Leste\n+670\nTogo\n+228\nTokelau\n+690\nTonga\n+676\nTrinidad & Tobago\n+1\nTunisia\n+216\nTurkey\n+90\nTurkmenistan\n+993\nTurks & Caicos Islands\n+1\nTuvalu\n+688\nU.S. Virgin Islands\n+1\nUganda\n+256\nUkraine\n+380\nUnited Arab Emirates\n+971\nUnited Kingdom\n+44\nUnited States\n+1\nUruguay\n+598\nUzbekistan\n+998\nVanuatu\n+678\nVatican City\n+39\nVenezuela\n+58\nVietnam\n+84\nWallis & Futuna\n+681\nWestern Sahara\n+212\nYemen\n+967\nZambia\n+260\nZimbabwe\n+263\nLocation (City)\n*\nResume/CV\n*\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nCover Letter\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nLinkedIn Profile\n*\nWebsite\nDo you currently live in the United States?\nSelect...\nWe are unable to employ candidates residing outside of the US.\nDue to the nature of our work, data, specifically personal health information may not be accessed, disclosed or used outside of the U.S. Please note that the U.S. is limited to the 50 states of the United States.\nVoluntary Self Identification\nAt Omada, we’re working every day to build a team where people from all backgrounds can thrive. To help us learn more about how we can increase diversity in our candidate pool, we invite you to provide demographic information in a confidential survey. Your responses will\nnot\nbe associated with your specific application and will not in any way be used in the hiring decision.\nI identify my gender as:\nSelect...\nI identify as transgender:\nSelect...\nI identify my sexual orientation as:\nSelect...\nWhich of the following best represents your racial or ethnic background: (Check more than one if that is how you identify)\nSelect...\nVeteran Status:\nSelect...\nDo you identify as a person with a disability of any kind, visible or invisible?\nSelect...\nPowered by\nGreenhouse"
  },
  {
    "title": "Reliability Design Team Lead",
    "company_name": "Astranis",
    "company_stage": "Growth",
    "location": "San Francisco",
    "industry": "American Dynamism, Enterprise",
    "category": "Engineering",
    "experience_level": "Lead/Manager",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$145,000 - $200,000",
    "description_url": "https://job-boards.greenhouse.io/astranis/jobs/4643124006",
    "required_skills": [
      "Equity",
      "PPAP",
      "Version Control Systems",
      "Supplier Quality",
      "Failure Analysis",
      "Product Lifecycle Management",
      "Space Technology",
      "Quality Assurance",
      "Materials Science",
      "Physics"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "What we offer:\nAll our positions offer a compensation package that includes equity and robust benefits.\nBase pay is a single component of Astranis's total rewards package, which may also include equity in the form of incentive stock options, high quality company-subsidized healthcare, disability and life insurance benefits, flexible PTO, 401(K) retirement, and free on-site catered meals.\nAstranis pay ranges are informed and defined through professional-grade salary surveys and compensation data sources. The actual base salary offered to a successful candidate will additionally be influenced by a variety of factors including experience, credentials & certifications, educational attainment, skill level requirements, and the level and scope of the position."
  },
  {
    "title": "Analytics and Insights Manager",
    "company_name": "Komodo Health",
    "company_stage": "Growth",
    "location": "United States",
    "industry": "Bio + Health, Enterprise",
    "category": "Operations",
    "experience_level": "Lead/Manager",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$112,000 - $165,000",
    "description_url": "https://job-boards.greenhouse.io/komodohealth/jobs/8363353002",
    "required_skills": [
      "Machine Learning",
      "Analytical Skills",
      "Client Relations",
      "HIPAA",
      "Python",
      "GDPR",
      "Project Management",
      "Data Visualization",
      "Treatment",
      "Google Cloud Platform",
      "SQL",
      "Professional Services",
      "Microsoft Azure",
      "Algorithms",
      "Statistics",
      "Analytics",
      "Decision-Making",
      "Analytics Tools",
      "Amazon Web Services",
      "Predictive Modeling"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "The pay range for each job posting reflects a minimum and maximum range of annual base pay that we reasonably expect to pay for this position within the US. We carefully consider multiple business-related factors when determining compensation, including job-related skills, work experience, geographic work location, relevant training and certifications, business needs and market demands.\nThe starting annual base pay for this role is listed below. This position may be eligible for performance-based bonuses as determined in the Company’s sole discretion and in accordance with a written agreement or plan. This role may also be eligible for equity awards. In addition, this role is eligible for benefits including, but not limited to, comprehensive health, dental, and vision insurance; flexible time off and holidays; 401(k) with company match; disability insurance and life insurance; and leaves of absence in accordance with applicable state and local laws and regulations and company policy."
  },
  {
    "title": "Digital Engineering Program Lead",
    "company_name": "Waymo",
    "company_stage": "Growth",
    "location": "Mountain View CA USA",
    "industry": "Enterprise",
    "category": "Operations",
    "experience_level": "Lead/Manager",
    "remote_option": false,
    "is_hybrid": true,
    "salary_range": "$196,000 - $248,000",
    "description_url": "https://careers.withwaymo.com/jobs?gh_jid=7435905",
    "required_skills": [
      "Program Management",
      "Financial technology",
      "ERP",
      "Budgeting",
      "Finance",
      "Procurement"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Waymo is an autonomous driving technology company with the mission to be the world's most trusted driver. Since its start as the Google Self-Driving Car Project in 2009, Waymo has focused on building the Waymo Driver—The World's Most Experienced Driver™—to improve access to mobility while saving thousands of lives now lost to traffic crashes. The Waymo Driver powers Waymo’s fully autonomous ride-hail service and can also be applied to a range of vehicle platforms and product use cases. The Waymo Driver has provided over ten million rider-only trips, enabled by its experience autonomously driving over 100 million miles on public roads and tens of billions in simulation across 15+ U.S. states.\nWaymo Digital Technology Digital engineering Program Managers are responsible for leading the effort to build and scale Waymo-wide processes and tools while maintaining a strong technical understanding of our technical platforms, software life cycle, release process and test operations. Partner with leaders across Waymo to translate the top-down corporate strategy and milestones into detailed technology road maps, timelines, and deliverables. Lead cross-functional teams to define and then track resource requirements (headcount and budget) as inputs to finance. Comfortable leading in a gray space and enabling teams to deliver tangible results. Influence key decisions working cross-functionally across Digital engineering, operations, finance, and strategy and other teams to reach the right conclusions. Define KPIs and other methods to measure metrics that best translate progress towards goals. Be the key interface with stakeholders and leadership and exercise judgment and discretion to develop solutions to remove obstacles and redefine approaches.\nIn this hybrid role, you will report to Head of Digital Portfolio, AI Delivery Governance & Strategy Realization\nYou will:\nWe are seeking a\nFinance Digital Engineering Program Lead\nto drive technology-enabled transformation across our Finance organization. This role will lead end-to-end delivery of digital engineering initiatives that modernize financial systems, elevate data quality, automate processes, and improve scalability across our rapidly growing enterprise.\nThe ideal candidate blends\ntechnical delivery\n,\nprogram leadership\n,\nbudget ownership\n, and\nfinancial domain expertise\n—enabling them to convert business needs into scalable digital solutions while managing resources, spend, and ROI.\nLead Digital Transformation:\nDirect end-to-end digital engineering programs to modernize financial systems and improve scalability.\nProgram & Budget Oversight:\nManage program governance, budget, resources, and ROI, leveraging technical and financial expertise.\nSystem Modernization:\nGuide the enhancement of core Finance platforms (ERP, revenue, reporting) via cloud architecture and API integrations.\nData & Automation:\nDrive automation (RPA/ML) and establish data consistency/governance for compliance and real-time analytics.\nCross-Functional Bridge:\nServe as the primary liaison, leading cross-functional teams (Engineering, Data, Product,Vendor) and translating Finance needs into clear technical requirements.\nChange Adoption:\nEnsure successful adoption of new tools and processes across the entire Finance organization.\nYou have:\n8+ years of experience in digital engineering, technical program management, or enterprise transformation.\nBachelor’s degree in computer science or related field and relevant experience.\nExperience delivering technology programs within\nFinance, FinTech, Accounting systems, Payments, or ERP\ndomains.\nStrong understanding of financial processes (close & consolidation, revenue, AP/AR, procurement, budgeting, controls).\nProven track record leading multi-team engineering initiatives in a fast-scaling environment.\nStrong stakeholder management, communication, and executive-level reporting skills.\nAbility to work across engineering, data, product, and finance teams with clarity and influence.\nWe prefer:\nExperience with ERP systems (SAP, Workday, Oracle), finance data platforms, or cloud-native architectures.\nFamiliarity with automation, AI/ML, workflow orchestration (e.g., ServiceNow, UiPath, Alteryx).\nPMP, Agile/Scrum certification, or equivalent technical program management experience.\nBackground in high-growth tech, autonomous systems, fin tech, or multi-entity global finance.\n((Remote jobs only - Please note that Waymo may not be able to employ remotely in all locations. Please speak with your recruiter about your preferred location for remote work when you begin the interview process.))\nThe expected base salary range for this full-time position across US locations is listed below. Actual starting pay will be based on job-related factors, including exact work location, experience, relevant training and education, and skill level. Your recruiter can share more about the specific salary range for the role location or, if the role can be performed remote, the specific salary range for your preferred location, during the hiring process.\nWaymo employees are also eligible to participate in Waymo’s discretionary annual bonus program, equity incentive plan, and generous Company benefits program, subject to eligibility requirements.\nSalary Range\n$196,000—$248,000 USD"
  },
  {
    "title": "Senior Solution Architect - East",
    "company_name": "Starburst",
    "company_stage": "Growth",
    "location": "New York",
    "industry": "Enterprise",
    "category": "Sales",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$200,000 - $240,000",
    "description_url": "https://job-boards.greenhouse.io/starburst/jobs/5058340008",
    "required_skills": [
      "Equity",
      "Field Sales",
      "Written Communication Skills",
      "Genetics",
      "Grant Writing"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Starburst is dedicated to maintaining fair and equitable compensation practices. The salary range provided for this role reflects the minimum and maximum targets for candidates across all U.S. locations and could be inclusive of variable compensation, such as commission or bonus. All employees receive equity packages (ISOs) and have access to a comprehensive benefits offering. Actual compensation packages are determined based on relevant skills, experience, education and training, and specific work location. For more information, connect with the recruiting team or Hiring Manager during the process as they can provide more detailed information about the salary range."
  },
  {
    "title": "Principal Product Manager",
    "company_name": "Cedar",
    "company_stage": "Growth",
    "location": "New York, NY, United States",
    "industry": "Fintech",
    "category": "Product",
    "experience_level": "Executive",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$221,000 - $260,000",
    "description_url": "https://www.cedar.com/open-roles/?gh_jid=7517704",
    "required_skills": [
      "Machine Learning",
      "Artificial Intelligence",
      "Personalization",
      "Experimentation",
      "ML Infrastructure",
      "Product Design",
      "Feature Extraction",
      "Cross-functional Team Leadership",
      "Data Engineering",
      "Recommender Systems"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Open Roles\nOPEN ROLES\nJoin our mission to make healthcare more affordable and accessible.\nCedar has been made aware of online solicitations using the Cedar name and fake job descriptions. Please see additional information regarding this situation at the bottom of this screen.\nAn award-winning place to work\nWe’re setting the standard for excellence in company culture.\nFor more insight, visit Cedar’s talent profile pages.\nSPAM WARNING\nCedar has been made aware of online solicitations using the Cedar name and fake job descriptions to pretend to hire persons seeking employment. These may include our trademarks and attachments asking the recipients to fill out questionnaires regarding employment history and other information to send back to the sender. These individuals are looking to collect personal information about you for the purpose of perpetrating a fraud or stealing your identity.\nAll legitimate Cedar job openings are posted on the Cedar corporate site at cedar.com/careers. If you have any questions or concerns about potential fraudulent employment opportunities or contact from someone supposedly representing Cedar, please reach out to us at careers@cedar.com.\nIf you have provided personally identifiable information (such as social security number, bank numbers or credit card information) to an unauthorized party, please contact one of the following agencies to report this disclosure and receive guidance on any further actions you should take to protect your identity:\n– FTC toll free hotline: 877-FTC-HELP (877-382-4357)\n– FTC online complaint form (http://www.ftc.gov/)\n– Internet Fraud Complaint Center (http://www.ic3.gov/)\n– Non-emergency number for your local police department."
  },
  {
    "title": "Software Engineer, Rider",
    "company_name": "Lime",
    "company_stage": "Growth",
    "location": "Canada, Canada",
    "industry": "Consumer",
    "category": "Engineering",
    "experience_level": "Mid",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$121,000 - $147,000",
    "description_url": "https://jobs.ashbyhq.com/Lime/477173b1-3eac-4b4a-aa57-61c0b53944ac",
    "required_skills": [
      "Equity",
      "User Experience",
      "Onboarding",
      "Ruby on Rails"
    ],
    "employee_count": "1000+ employees",
    "full_description": "Software Engineer, Rider @ Lime\nYou need to enable JavaScript to run this app.\nSoftware Engineer, Rider\nLocation\nCanada\nEmployment Type\nFull time\nLocation Type\nRemote\nDepartment\nEngineering\nCompensation\nCA$121K – CA$147K • Offers Equity • Offers Bonus\nOverview\nApplication\nLime is the largest global shared micromobility business, operating in close to 30 countries across five continents. We’re on a mission to build a future where transportation is shared, affordable and carbon-free. Our electric bikes and scooters have powered more than one billion rides in cities around the world. Named a 2025 Time 100 Most Influential Company, Lime continues to set the pace for shared micromobility globally, spurring a new generation of clean alternatives to car ownership.\nWe are looking for a strong software engineer for the Rider team to build the best user experience for our customers. The Rider team is the heart of Lime’s business. We are responsible for improving Lime’s core riding experience including signup, onboarding, trip flow, pricing, subscriptions, and much more. Our goal is to build the perfect experience for our customers so that they become power users. You’ll be working on big bets, scaling up successful products, learning new technologies and contributing to key strategic initiatives. The best part? You’ll be able to showcase all that you built to your friends and family.\nWhat You’ll do:\nIdentify, define, and solve strategically essential consumer-facing rider problems, including architecting and building highly scalable foundational product platforms, leading new product initiatives, and revamping core rider experiences.\nScrutinize and reason clearly about the technology and architecture choices we make. In many cases, you will be the decider of these decisions.\nLead the cross-functional collaboration with PMs, Engineers, Design, Data Scientists, Research, and Operations teams.\nMentor and support other engineers on the team. Identify and develop future leaders.\nAdvise Lime’s leadership team on key technology adoption and process improvements.\nAbout You:\n2+ years of industry professional software development experience, and a track record of building impactful products or systems.\nCustomer obsessed. You put customers first.\nData driven. You have a strong data insight and rely on data to make decisions.\nOwner’s mindset. You're a self-starter and get things across the finish line.\nStrong collaborator. You understand cross-functional strategies and involve key stakeholders in decision making.\nPassionate. You’re passionate about Lime's mission and micromobility; you want to see cities transform to becoming people-centric and less polluted.\nOutcomes oriented. You focus on impact and have a track record for driving meaningful business results.\nStrong influencer. You motivate and empower your team to go above and beyond and have driven bar-raising activities in the past\n1+ years of experience coding in Ruby on Rails preferred\nThe salary range listed reflects what Lime reasonably expects to offer for this role, with the final base salary determined by factors such as the candidate’s location and relevant skills and experience. Depending on the position, the total compensation package may also include discretionary annual performance bonus opportunities and equity, subject to applicable plan terms and eligibility requirements.\n#LI-PP1\n#LI-Remote\nIf you want to make an impact, Lime is the place for you. Not sure if you meet all the qualifications? If this role excites you we encourage you to apply. Explore all opportunities on our career page.\nLime is proud to be an Equal Opportunity Employer. We believe different perspectives help us grow and achieve more. That’s why we’re dedicated to building and developing a team that reflects a wider range of backgrounds, abilities, identities, and experiences.  If you require a reasonable accommodation during the application or hiring process, please email recruiting-operations@li.me for assistance.\nCompensation Range: CA$121K - CA$147K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Accounts Payable Manager",
    "company_name": "UnitedMasters",
    "company_stage": "Growth",
    "location": "Brooklyn, New York",
    "industry": "Consumer",
    "category": "Finance",
    "experience_level": "Lead/Manager",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$100,000 - $125,000",
    "description_url": "https://job-boards.greenhouse.io/unitedmasterstranslation/jobs/8366092002",
    "required_skills": [
      "Aging",
      "Compliance",
      "Vendor Management",
      "Financial Analysis",
      "Transaction Processing",
      "Financial Statements",
      "Attention to Detail",
      "Onboarding"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Job Application for Accounts Payable Manager at UnitedMasters | Translation\nBack to jobs\nNew\nAccounts Payable Manager\nBrooklyn, New York\nWho We Are\nUnitedMasters is building a marketplace that connects artists, brands and fans - empowering artists to earn and grow. UnitedMasters has taken the bold step of building a music distribution service that, radically, puts artists first - disrupting the legacy music business by letting up-and-coming artists distribute their music directly to fans through streaming services while maintaining ownership of their master recording rights and up to 100% of royalties. Through the combination of UnitedMasters’ music distribution platform and its deep ties to brands, UnitedMasters enables independent artists and change-makers to grow and earn unlike any other platform.\nThe UnitedMasters team is made up of musicians, marketers, engineers, and storytellers with backgrounds from YouTube, SoundCloud, Pandora, Facebook, Uber, Dropbox, Complex, VICE, and more. We work hand in hand with the award-winning creative teams that forge those innovative partnerships at Translation (our in-house creative advertising agency).\nWe are looking for an Accounts Payable Manager to join UnitedMasters! In this role, you’ll own the end-to-end accounts payable function, managing vendor onboarding, invoice processing, payments, month-end close, and audit support. You’ll partner cross-functionally to ensure accurate, timely payments, maintain strong controls and compliance, and deliver clear AP and cash-flow reporting in a fast-paced, creative environment.\nThis role is based in Brooklyn, New York with four days in-office and one day remote.\nWhat You'll Do\nOversee the full AP cycle: invoice intake and validation, three-way matching (where applicable), approval workflows, and vendor reconciliations.\nManage vendor onboarding and ongoing relationships to ensure the accurate setup and maintenance of vendor records and timely, accurate payment of invoices.\nGather and maintain required documentation including W-9s, bank details, executed contracts, and other compliance-related client/vendor records.\nLead and execute month-end AP close activities, including reconciliations, audit support (PBC requests, walkthroughs, and evidence documentation).\nEnsure compliance with U.S. tax regulations, regulatory requirements, and internal policies related to accounts payable.\nProcess vendor invoices, manage approval workflows, and prepare weekly payment batches\nProduce accurate and timely AP and cash-flow reports, including aging analyses and management summaries.\nMaintain and enforce AP controls and vendor onboarding standards\nPrepare domestic and international wire payments\nDevelop short-term cash-flow forecasts to support business planning\nDeliver accurate reports to management in order to to meet daily, weekly, and monthly deadlines\nMaintain 3rd party platforms such as\nBill.com\nManage vendor tax reporting requirements, including 1099 preparation and filing\nSupport audits and contribute to process improvements\nKnowledge, Skills and Abilities\nStrong understanding of accounts payable fundamentals, including invoice processing, payment workflows, and aging analysis\nExperience managing international wire transfers, with preference for Brazil and Africa\nProven ability to perform detailed reconciliations, cost reclassifications, and ad hoc financial analysis\nExperience managing vendor relationships and supplier onboarding, including documentation collection (W-9s, banking details, contracts)\nAbility to review and interpret contracts for payment, compliance, and accounting implications\nMinimum Qualifications\n5+ years of experience in vendor setup and accounts payable transaction processing\nBachelor’s degree in Accounting or a related field\nStrong written and verbal communication skills with both internal and external stakeholders\nHighly organized with strong attention to detail and ability to manage multiple priorities\nPreferred Qualifications\nExperience with NetSuite and Bill.com\nExperience in an agency, content production, media, or music industry environment\nAbout UnitedMasters, Inc.\nUnitedMasters Inc. represents the creative solutions company, Translation, and the leading software and services platform for independent creators, UnitedMasters. UnitedMasters enables ownership, exposure, and new paths for financial return for independent creators, while Translation helps brands leverage the power of contemporary culture to achieve transformational growth. Combined, UnitedMasters, Inc. is the world’s leading marketplace for cultural capital, connecting independent artists and brands to realize a future in which all creators own their future. Backed by Alphabet, Andreessen Horowitz, and Apple, UnitedMasters, Inc. is reimagining how brands and artists come together to tell their stories, build profitable growth, and push culture forward.\nSalary Hiring Range:\n$100,000 - $125,000\nOur salary ranges are based on paying competitively for our size and industry, and are one part of many compensation, benefits and other reward opportunities we provide (e.g. bonus, stock options, 401(k) match, etc.)\nIndividual pay rate decisions are based on a number of factors, including qualifications for the role, experience level, skillset, and balancing internal equity relative to peers at the company.  We expect the majority of the candidates who are offered roles at our company to fall healthily throughout the range based on these factors.\nThe range above is for the expectations as laid out in the job description, however we are often open to a wide variety of profiles, and recognize that the person we hire may be less experienced (or more senior) than this job description as posted.  If that ends up being the case, the updated salary range will be communicated with you as a candidate.\nThe salary range above is for the NY/CA.  As a company, we have a location based strategy, which means the salary range could be lower or higher than this if the role is hired in another location.\n#LI-HYBRID\nCreate a Job Alert\nInterested in building your career at UnitedMasters | Translation? Get future opportunities sent straight to your email.\nCreate alert\nApply for this job\n*\nindicates a required field\nFirst Name\n*\nLast Name\n*\nPreferred First Name\nEmail\n*\nPhone\nCountry\n*\nPhone\n*\n244 results found\nNo results found\nAfghanistan\n+93\nÅland Islands\n+358\nAlbania\n+355\nAlgeria\n+213\nAmerican Samoa\n+1\nAndorra\n+376\nAngola\n+244\nAnguilla\n+1\nAntigua & Barbuda\n+1\nArgentina\n+54\nArmenia\n+374\nAruba\n+297\nAscension Island\n+247\nAustralia\n+61\nAustria\n+43\nAzerbaijan\n+994\nBahamas\n+1\nBahrain\n+973\nBangladesh\n+880\nBarbados\n+1\nBelarus\n+375\nBelgium\n+32\nBelize\n+501\nBenin\n+229\nBermuda\n+1\nBhutan\n+975\nBolivia\n+591\nBosnia & Herzegovina\n+387\nBotswana\n+267\nBrazil\n+55\nBritish Indian Ocean Territory\n+246\nBritish Virgin Islands\n+1\nBrunei\n+673\nBulgaria\n+359\nBurkina Faso\n+226\nBurundi\n+257\nCambodia\n+855\nCameroon\n+237\nCanada\n+1\nCape Verde\n+238\nCaribbean Netherlands\n+599\nCayman Islands\n+1\nCentral African Republic\n+236\nChad\n+235\nChile\n+56\nChina\n+86\nChristmas Island\n+61\nCocos (Keeling) Islands\n+61\nColombia\n+57\nComoros\n+269\nCongo - Brazzaville\n+242\nCongo - Kinshasa\n+243\nCook Islands\n+682\nCosta Rica\n+506\nCôte d’Ivoire\n+225\nCroatia\n+385\nCuba\n+53\nCuraçao\n+599\nCyprus\n+357\nCzechia\n+420\nDenmark\n+45\nDjibouti\n+253\nDominica\n+1\nDominican Republic\n+1\nEcuador\n+593\nEgypt\n+20\nEl Salvador\n+503\nEquatorial Guinea\n+240\nEritrea\n+291\nEstonia\n+372\nEswatini\n+268\nEthiopia\n+251\nFalkland Islands\n+500\nFaroe Islands\n+298\nFiji\n+679\nFinland\n+358\nFrance\n+33\nFrench Guiana\n+594\nFrench Polynesia\n+689\nGabon\n+241\nGambia\n+220\nGeorgia\n+995\nGermany\n+49\nGhana\n+233\nGibraltar\n+350\nGreece\n+30\nGreenland\n+299\nGrenada\n+1\nGuadeloupe\n+590\nGuam\n+1\nGuatemala\n+502\nGuernsey\n+44\nGuinea\n+224\nGuinea-Bissau\n+245\nGuyana\n+592\nHaiti\n+509\nHonduras\n+504\nHong Kong SAR China\n+852\nHungary\n+36\nIceland\n+354\nIndia\n+91\nIndonesia\n+62\nIran\n+98\nIraq\n+964\nIreland\n+353\nIsle of Man\n+44\nIsrael\n+972\nItaly\n+39\nJamaica\n+1\nJapan\n+81\nJersey\n+44\nJordan\n+962\nKazakhstan\n+7\nKenya\n+254\nKiribati\n+686\nKosovo\n+383\nKuwait\n+965\nKyrgyzstan\n+996\nLaos\n+856\nLatvia\n+371\nLebanon\n+961\nLesotho\n+266\nLiberia\n+231\nLibya\n+218\nLiechtenstein\n+423\nLithuania\n+370\nLuxembourg\n+352\nMacao SAR China\n+853\nMadagascar\n+261\nMalawi\n+265\nMalaysia\n+60\nMaldives\n+960\nMali\n+223\nMalta\n+356\nMarshall Islands\n+692\nMartinique\n+596\nMauritania\n+222\nMauritius\n+230\nMayotte\n+262\nMexico\n+52\nMicronesia\n+691\nMoldova\n+373\nMonaco\n+377\nMongolia\n+976\nMontenegro\n+382\nMontserrat\n+1\nMorocco\n+212\nMozambique\n+258\nMyanmar (Burma)\n+95\nNamibia\n+264\nNauru\n+674\nNepal\n+977\nNetherlands\n+31\nNew Caledonia\n+687\nNew Zealand\n+64\nNicaragua\n+505\nNiger\n+227\nNigeria\n+234\nNiue\n+683\nNorfolk Island\n+672\nNorth Korea\n+850\nNorth Macedonia\n+389\nNorthern Mariana Islands\n+1\nNorway\n+47\nOman\n+968\nPakistan\n+92\nPalau\n+680\nPalestinian Territories\n+970\nPanama\n+507\nPapua New Guinea\n+675\nParaguay\n+595\nPeru\n+51\nPhilippines\n+63\nPoland\n+48\nPortugal\n+351\nPuerto Rico\n+1\nQatar\n+974\nRéunion\n+262\nRomania\n+40\nRussia\n+7\nRwanda\n+250\nSamoa\n+685\nSan Marino\n+378\nSão Tomé & Príncipe\n+239\nSaudi Arabia\n+966\nSenegal\n+221\nSerbia\n+381\nSeychelles\n+248\nSierra Leone\n+232\nSingapore\n+65\nSint Maarten\n+1\nSlovakia\n+421\nSlovenia\n+386\nSolomon Islands\n+677\nSomalia\n+252\nSouth Africa\n+27\nSouth Korea\n+82\nSouth Sudan\n+211\nSpain\n+34\nSri Lanka\n+94\nSt. Barthélemy\n+590\nSt. Helena\n+290\nSt. Kitts & Nevis\n+1\nSt. Lucia\n+1\nSt. Martin\n+590\nSt. Pierre & Miquelon\n+508\nSt. Vincent & Grenadines\n+1\nSudan\n+249\nSuriname\n+597\nSvalbard & Jan Mayen\n+47\nSweden\n+46\nSwitzerland\n+41\nSyria\n+963\nTaiwan\n+886\nTajikistan\n+992\nTanzania\n+255\nThailand\n+66\nTimor-Leste\n+670\nTogo\n+228\nTokelau\n+690\nTonga\n+676\nTrinidad & Tobago\n+1\nTunisia\n+216\nTurkey\n+90\nTurkmenistan\n+993\nTurks & Caicos Islands\n+1\nTuvalu\n+688\nU.S. Virgin Islands\n+1\nUganda\n+256\nUkraine\n+380\nUnited Arab Emirates\n+971\nUnited Kingdom\n+44\nUnited States\n+1\nUruguay\n+598\nUzbekistan\n+998\nVanuatu\n+678\nVatican City\n+39\nVenezuela\n+58\nVietnam\n+84\nWallis & Futuna\n+681\nWestern Sahara\n+212\nYemen\n+967\nZambia\n+260\nZimbabwe\n+263\nResume/CV\n*\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nCover Letter\nAttach\nEnter manually\nAccepted file types: pdf, doc, docx, txt, rtf\nAre you legally eligible for employment in the United States?\n*\nSelect...\nWill you now or in the future require UnitedMasters, Inc. to file a petition or application for employment - based status on your behalf to begin or continue employment with UnitedMasters, Inc.? If you have nonimmigrant status, for example F-1 or H-1, your answer to this question should be yes.\n*\nSelect...\nLinkedIn Profile\nWebsite\nVoluntary Self-Identification\nFor government reporting purposes, we ask candidates to respond to the below self-identification survey.\nCompletion of the form is entirely voluntary. Whatever your decision, it will not be considered in the hiring\nprocess or thereafter. Any information that you do provide will be recorded and maintained in a\nconfidential file.\nAs set forth in UnitedMasters | Translation’s Equal Employment Opportunity policy,\nwe do not discriminate on the basis of any protected group status under any applicable law.\nGender\nSelect...\nAre you Hispanic/Latino?\nSelect...\nRace & Ethnicity Definitions\nIf you believe you belong to any of the categories of protected veterans listed below, please indicate by making the appropriate selection.\n  As a government contractor subject to the Vietnam Era Veterans Readjustment Assistance Act (VEVRAA), we request this information in order to measure\n  the effectiveness of the outreach and positive recruitment efforts we undertake pursuant to VEVRAA. Classification of protected categories\n  is as follows:\nA \"disabled veteran\" is one of the following: a veteran of the U.S. military, ground, naval or air service who is entitled to compensation (or who but for the receipt of military retired pay would be entitled to compensation) under laws administered by the Secretary of Veterans Affairs; or a person who was discharged or released from active duty because of a service-connected disability.\nA \"recently separated veteran\" means any veteran during the three-year period beginning on the date of such veteran's discharge or release from active duty in the U.S. military, ground, naval, or air service.\nAn \"active duty wartime or campaign badge veteran\" means a veteran who served on active duty in the U.S. military, ground, naval or air service during a war, or in a campaign or expedition for which a campaign badge has been authorized under the laws administered by the Department of Defense.\nAn \"Armed forces service medal veteran\" means a veteran who, while serving on active duty in the U.S. military, ground, naval or air service, participated in a United States military operation for which an Armed Forces service medal was awarded pursuant to Executive Order 12985.\nVeteran Status\nSelect...\nVoluntary Self-Identification of Disability\nForm CC-305\nPage 1 of 1\nOMB Control Number 1250-0005\nExpires 04/30/2026\nWhy are you being asked to complete this form?\nWe are a federal contractor or subcontractor. The law requires us to provide equal employment opportunity to qualified people with disabilities. We have a goal of having at least 7% of our workers as people with disabilities. The law says we must measure our progress towards this goal. To do this, we must ask applicants and employees if they have a disability or have ever had one. People can become disabled, so we need to ask this question at least every five years.\nCompleting this form is voluntary, and we hope that you will choose to do so. Your answer is confidential. No one who makes hiring decisions will see it. Your decision to complete the form and your answer will not harm you in any way. If you want to learn more about the law or this form, visit the U.S. Department of Labor’s Office of Federal Contract Compliance Programs (OFCCP) website at\nwww.dol.gov/ofccp\n.\nHow do you know if you have a disability?\nA disability is a condition that substantially limits one or more of your “major life activities.” If you have or have ever had such a condition, you are a person with a disability.\nDisabilities include, but are not limited to:\nAlcohol or other substance use disorder (not currently using drugs illegally)\nAutoimmune disorder, for example, lupus, fibromyalgia, rheumatoid arthritis, HIV/AIDS\nBlind or low vision\nCancer (past or present)\nCardiovascular or heart disease\nCeliac disease\nCerebral palsy\nDeaf or serious difficulty hearing\nDiabetes\nDisfigurement, for example, disfigurement caused by burns, wounds, accidents, or congenital disorders\nEpilepsy or other seizure disorder\nGastrointestinal disorders, for example, Crohn's Disease, irritable bowel syndrome\nIntellectual or developmental disability\nMental health conditions, for example, depression, bipolar disorder, anxiety disorder, schizophrenia, PTSD\nMissing limbs or partially missing limbs\nMobility impairment, benefiting from the use of a wheelchair, scooter, walker, leg brace(s) and/or other supports\nNervous system condition, for example, migraine headaches, Parkinson’s disease, multiple sclerosis (MS)\nNeurodivergence, for example, attention-deficit/hyperactivity disorder (ADHD), autism spectrum disorder, dyslexia, dyspraxia, other learning disabilities\nPartial or complete paralysis (any cause)\nPulmonary or respiratory conditions, for example, tuberculosis, asthma, emphysema\nShort stature (dwarfism)\nTraumatic brain injury\nDisability Status\nSelect...\nPUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no persons are required to respond to a collection of information unless such collection displays a valid OMB control number. This survey should take about 5 minutes to complete.\nPowered by\nGreenhouse"
  },
  {
    "title": "Enterprise Account Manager",
    "company_name": "Replit",
    "company_stage": "Growth",
    "location": "New York City, New York, United States, NYC (SoHo) Hybrid",
    "industry": "Consumer",
    "category": "Sales",
    "experience_level": "Mid",
    "remote_option": false,
    "is_hybrid": true,
    "salary_range": "$140,000 - $240,000",
    "description_url": "https://jobs.ashbyhq.com/replit/ebc39bd6-f32b-4e1b-bda2-30467453c725",
    "required_skills": [
      "Full Stack Development",
      "CRM",
      "Developer Tools",
      "Artificial Intelligence",
      "HubSpot",
      "Account Management",
      "Automation Systems",
      "Software as a Service",
      "Natural Language Processing",
      "Partnership Development",
      "Onboarding",
      "Automation",
      "Technical Sales",
      "Forecasting",
      "Rapid Prototyping"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Enterprise Account Manager @ Replit\nYou need to enable JavaScript to run this app.\nEnterprise Account Manager\nLocation\nNYC (SoHo) Hybrid\nEmployment Type\nFull time\nLocation Type\nHybrid\nDepartment\nGTM\nCompensation\nCompensation is determined based on career level, with the base salary for this role ranging from $140K – $240K • Offers Equity • Offers Bonus • Performance Based Bonus\nOverview\nApplication\nReplit is the agentic software creation platform that enables anyone to build applications using natural language. With millions of users worldwide and over 500,000 business users, Replit is democratizing software development by removing traditional barriers to application creation.\nAbout the Role\nReplit is one of the fastest growing companies in the world, having gone from $2.5M in ARR to over $150M in just 10 months.  We provide the fastest way to turn ideas into software. With our powerful AI-powered Agent and Assistant, anyone can create and launch apps from natural language in just one click. Build and deploy full-stack applications directly from your browser—no setup required. Never written a line of code in your life? No problem. Replit makes software creation accessible, collaborative, and lightning-fast. Join us in our mission to empower the next generation of builders.\nReplit is experiencing extraordinary growth across our customer base and seeking an Enterprise Account Manager with strong communication skills to drive retention, expansion, and customer success. Candidates with Customer Success or Enterprise Account Management experience in SaaS, particularly with some technical background (i.e. having some coding knowledge or prior experience at other developer tool companies) are ideal.\nWe believe this role offers a distinctive opportunity for people who excel in client-facing situations and have a passion for customer success and AI. You'll leverage your skills to help customers maximize value from Replit's platform while driving sustainable revenue growth.\nIn this role you will:\nServe as the primary relationship owner for your assigned customer portfolio, ensuring high satisfaction and retention\nChampion customer success by helping businesses realize the transformative potential of AI-powered software creation\nLead onboarding programs that accelerate customer time-to-value and platform adoption\nGuide customers through Replit's rapidly evolving feature set, including Agent 3's autonomous capabilities, Plan Mode, and automation tools\nExecute renewal processes with a focus on expansion and long-term partnership development\nMaintain accurate customer health scores and renewal forecasting data in Replit's CRM (Hubspot)\nGather and communicate valuable customer feedback, championing their interests within Replit\nOptimize customers' use of the Replit platform through ongoing training, support, and strategic guidance\nRequired skills and experience:\n3-5+ years of experience in Customer Success, Enterprise Account Management, or technical sales role, preferably in SaaS or developer tools\nExcellent communication skills, with the ability to explain technical concepts to non-technical audiences\nProven track record of meeting or exceeding renewal and expansion revenue targets\nExperience managing customer relationships from onboarding through renewal and expansion\nProficiency in using CRM systems and customer success tools (e.g., Hubspot)\nAbility to quickly learn and articulate the value of new technologies to diverse customer segments\nStrong problem-solving skills and consultative approach to customer challenges\nSelf-motivated with excellent time management and organizational skills for managing multiple accounts\nPassion for technology and staying current with industry trends, particularly AI and automation\nExperience with or strong interest in AI is a plus\nComfort with data analysis to drive customer success metrics and identify growth opportunities\nNice to have:\nYou're an active Replit user\nYou've worked at an early-stage startup or in developer tools\nExperience with rapid prototyping, product development workflows, or business process automation\nBackground in customer success at companies serving technical or semi-technical user bases\nDegree in Computer Science, Engineering, Business, or a related field (or equivalent practical experience)\nTools + Tech Stack for this role:\nReplit\nHubspot CRM\nCustomer success and analytics platforms\nZoomInfo\nLinkedIn Sales Navigator\nHashboard, Hex\nVarious customer communication and project management tools\nThis role may\nnot\nbe a fit if:\nYou're not passionate about helping customers succeed and driving long-term relationships\nYou lack an understanding of the software development lifecycle or have little interest in learning about technical workflows\nYou're not excited about AI and its potential to transform how businesses operate\nYou don't enjoy being in client-facing roles where 80% of your day is talking to customers\nYou prefer transactional interactions over building deep, strategic relationship\nThis is a full-time role that can be held from our NYC office. This role has an in-office requirement.\nFull-Time Employee Benefits Include:\n💰 Competitive Salary & Equity\n💹 401(k) Program\n⚕️ Health, Dental, Vision and Life Insurance\n🩼 Short Term and Long Term Disability\n🚼 Paid Parental, Medical, Caregiver Leave\n🚗 Commuter Benefits\n📱 Monthly Wellness Stipend\n🧑‍💻 Autonoumous Work Environement\n🖥 In Office Set-Up Reimbursement\n🏝 Flexible Time Off (FTO) + Holidays\n🚀 Quarterly Team Gatherings\n☕ In Office Amenities\nWant to learn more about what we are up to?\nMeet the Replit Agent\nReplit: Make an app for that\nReplit Blog\nAmjad TED Talk\nInterviewing + Culture at Replit\nOperating Principles\nReasons not to work at Replit\nTo achieve our mission of making programming more accessible around the world, we need our team to be representative of the world. We welcome your unique perspective and experiences in shaping this product. We encourage people from all kinds of backgrounds to apply, including and especially candidates from underrepresented and non-traditional backgrounds.\nCompensation Range: $140K - $240K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Controller",
    "company_name": "Tennr",
    "company_stage": "Growth",
    "location": "New York City, New York, USA, New York City Office",
    "industry": "Enterprise",
    "category": "Finance",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$150,000 - $190,000",
    "description_url": "https://jobs.ashbyhq.com/tennr/7cf1b02c-d0ca-4cc8-8c61-b772a56b459d",
    "required_skills": [
      "Full-cycle",
      "Excel models",
      "External Audit",
      "GAAP",
      "QuickBooks",
      "Financial Reporting",
      "CPA",
      "Software as a Service",
      "NetSuite"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Controller @ Tennr\nYou need to enable JavaScript to run this app.\nController\nLocation\nNew York City Office\nEmployment Type\nFull time\nDepartment\nBusiness Operations\nCompensation\n$150K – $190K • Offers Equity\nOverview\nApplication\nCompany Description\nToday, when you go to your doctor and get referred to a specialist (e.g., for sleep apnea), your doctor sends out a referral and tells you, “They’ll be in touch soon.” So you wait. And wait. Sometimes days, weeks, or even months. Why? Because too often specialists and medical services are overwhelmed with referrals and the painstakingly manual process it takes to qualify your referral prevents them from getting around to it on time, or sometimes at all. Tennr prevents these delays and denials by making sure every referral gets where it needs to go, with the right info, at the right time. Powered by RaeLM™ Tennr reads, extracts, and acts on every piece of patient information so providers can capture more referrals, slash denials, and reduce delays.\nRole Description\nWe’re looking for a Controller to own the day-to-day accounting function and build the operating backbone for a scaling company. You’ll run a clean monthly close, tighten controls, level-up reporting, and partner cross-functionally (FP&A, RevOps, Sales, Legal, People) to ensure we’re accurate, audit-ready, and making decisions with trustworthy numbers. This role reports to the CFO and is based in our NYC office.\nThis is a hands-on role. You’ll do the work and improve the work—building processes, cleaning up what’s messy, and making it easier for everyone to move faster with confidence.\nResponsibilities\nOversee the preparation and presentation of accurate and timely financial statements in accordance with GAAP.\nEnsure proper internal controls are in place to safeguard company assets, monitor financial performance, and ensure regulatory compliance.\nLead the monthly, quarterly, and annual financial close process, including account reconciliations, journal entries, tax reporting, and variance analyses.\nDevelop and maintain a robust system of internal controls to safeguard company assets and ensure data integrity.\nCoordinate and oversee annual audit, including preparation and coordination of audit schedules and support requested by external auditors.\nProvide financial data and analysis to support ad hoc projects related to strategic decision-making, budgeting, and long-term financial planning.\nManage the current outsourced accounting function with the near-term goal of building a top tier Accounting function in house.\nQualifications\nRequired\n5+ years of progressive accounting experience, with at least 2 years in a Controller or Assistant Controller role, preferably at a high-growth technology company.\nCPA (or equivalent) and deep technical knowledge of US GAAP.\nProven experience in managing a full-cycle accounting process, including financial close and external audit.\nProficiency in financial reporting software (e.g., NetSuite, QuickBooks) and advanced Excel modeling skills.\nStrong written and verbal communication skills, with the ability to clearly articulate complex financial issues to non-financial stakeholders.\nPreferred\nExperience working with venture-backed companies and understanding of SaaS or recurring revenue accounting models.\nFamiliarity with financial regulations in the US healthcare industry.\nBackground in process automation and implementing new financial systems.\nExperience working in a remote or hybrid environment.\nWhy Tennr?\nDrive Impact: one of our company values is Cowboy, meaning you set the pace. You won’t just talk about things, you’ll get them done. And feel the impact.\nDevelop Operational Expertise: learn the inner workings of scaling systems, tools, and infrastructure\nInnovate with Purpose: we’re not just doing this for fun (although we do have a lot of fun). At Tennr, you’ll join a high-caliber team maniacally focused on reducing patient delays across the U.S. healthcare system.\nBuild Relationships: collaborate and connect with like-minded, driven individuals in our Chelsea office 4 days/week (preferred)\nFree lunch! Plus a pantry full of snacks.\nBenefits\nNew, spacious Chelsea office\nUnlimited PTO\n100% paid employee health benefit options\nEmployer-funded 401(k) match\nCompetitive parental leave\nCompensation Range: $150K - $190K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Software Engineering Manager",
    "company_name": "Mirage",
    "company_stage": "Growth",
    "location": "New York, NY, USA, Union Square, New York City",
    "industry": "AI, Consumer",
    "category": "Engineering",
    "experience_level": "Lead/Manager",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$250,000 - $350,000",
    "description_url": "https://jobs.ashbyhq.com/mirage/b2890659-6fce-45da-8435-1ee2c36c23ef",
    "required_skills": [
      "Infrastructure",
      "Artificial Intelligence",
      "White Papers",
      "Research",
      "Developer Experience",
      "Full Stack Development",
      "Podcasting"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Software Engineering Manager @ Mirage\nYou need to enable JavaScript to run this app.\nSoftware Engineering Manager\nLocation\nUnion Square, New York City\nEmployment Type\nFull time\nDepartment\nEngineering\nCompensation\n$250K – $350K • Offers Equity\nThe successful candidate's starting compensation will be determined based on their skills, experience, qualifications, and market conditions. Please know that this pay range may be modified in the future.\nOverview\nApplication\nMirage is the leading AI short-form video company. We’re building full-stack foundation models and products that redefine video creation, production and editing. Over 20 million creators and businesses use Mirage’s products to reach their full creative and commercial potential.\nWe are a rapidly growing team of ambitious, experienced, and devoted engineers, researchers, designers, marketers, and operators based in NYC. As an early member of our team, you’ll have an opportunity to have an outsized impact on our products and our company's culture.\nOur Products\nCaptions\nMirage Studio\nOur Technology\nAI Research @ Mirage\nMirage Model Announcement\nSeeing Voices (white-paper)\nPress Coverage\nTechCrunch\nLenny’s Podcast\nForbes AI 50\nFast Company\nOur Investors\nWe’re very fortunate to have some the best investors and entrepreneurs backing us, including\nIndex Ventures, Kleiner Perkins, Sequoia Capital, Andreessen Horowitz\n, Uncommon Projects, Kevin Systrom, Mike Krieger, Lenny Rachitsky, Antoine Martin, Julie Zhuo, Ben Rubin, Jaren Glover, SVAngel, 20VC, Ludlow Ventures, Chapter One, and more.\n** Please note that all of our roles will require you to be in-person at our NYC HQ (located in Union Square)\nWe do not work with third-party recruiting agencies, please do not contact us**\nSoftware Engineering Manager\nEngineering at Mirage isn’t narrowly defined. As a small, collaborative team, engineers are trusted with a high degree of ownership and agency. As an Engineering Manager, you’ll lead and grow a world-class team of software engineers while providing clear direction and stability. You’ll be responsible for driving technical excellence, fostering growth and collaboration, and building foundational capabilities across product, infrastructure, and core platforms.\nResponsibilities\nOversee the design and operation of our core platform (3rd party providers, storage, billing, observability, security, API).\nProvide technical leadership for various product and platform features\nImprove developer experience so the whole team ships faster\nGuide efforts that bridge AI research to production across all modalities (video, audio, image, text)\nUnderstand the capabilities and limitations of SOTA AI models and how to best leverage them in products\nPartner with product, design, and research to keep our development tightly aligned with user needs and business objectives\nWhat Makes You a Great Fit\nA track record of building, mentoring, and managing high-performing engineering teams\nExperience shipping high-impact systems, platforms, and products in production\nExcellent judgment: you balance technical discernment with a strong sense of practicality and time management\nAble to operate effectively in an extremely fast-paced environment, while setting your team up for sustainable success\nStrong communicator who can inspire and align a multidisciplinary team\nEven Better If...\nYou have worked extensively with LLMs, generative media models, and have a pulse on where the technology is going\nYou are grounded, collaborative, and willing to do whatever it takes to help the team win\nYou have been a startup founder or an early engineer at one\nBenefits:\nComprehensive medical, dental, and vision plans\n401K with employer match\nCommuter Benefits\nCatered lunch multiple days per week\nDinner stipend every night if you're working late and want a bite!\nGrubhub subscription\nHealth & Wellness Perks (Talkspace, Kindbody, One Medical subscription, HealthAdvocate, Teladoc)\nMultiple team offsites per year with team events every month\nGenerous PTO policy\nCaptions provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nPlease note benefits apply to full time employees only.\nCompensation Range: $250K - $350K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Design Engineer",
    "company_name": "Hedra",
    "company_stage": "Growth",
    "location": "San Francisco, California, United States, New York, New York, United States, San Francisco, New York",
    "industry": "Games",
    "category": "Engineering",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$175,000 - $275,000",
    "description_url": "https://jobs.ashbyhq.com/hedra/d8c03259-ce98-474a-986e-2c662fc9ee3a",
    "required_skills": [
      "React.js",
      "Tailwind",
      "CSS",
      "Next.js",
      "Design Systems",
      "TypeScript",
      "JavaScript",
      "REST"
    ],
    "employee_count": "10-100 employees",
    "full_description": "Design Engineer @ Hedra\nYou need to enable JavaScript to run this app.\nDesign Engineer\nLocation\nSan Francisco, New York\nEmployment Type\nFull time\nDepartment\nEngineering\nCompensation\nEstimated Base Salary $175K – $275K • Offers Equity and Comprehensive Benefits Package\nOverview\nApplication\nAbout Hedra:\nHedra is a pioneering generative media company backed by top investors at A16Z, Index, and Abstract Ventures. We're building Hedra Studio, a multimodal creation platform capable of control, emotion, and creative intelligence.\nAt the core of Hedra Studio is our\nCharacter-3\nfoundation model, the first omnimodal model in production. Character-3 jointly reasons across image, text, and audio for more intelligent video generation — it’s the next evolution of AI-driven content creation.\nSummary:\nAs a Design Engineer, you'll build Hedra's next generation collaborative web interfaces for creating, optimizing, and deploying generative media leveraging the latest media foundation models from Hedra and beyond. You will build novel interaction paradigms that power a tool used by millions of creators.\nExperience:\nExperience using React, Typescript, Javascript, and NextJS\nExperience interfacing with RESTful APIs, and familiar with standards such as OpenAPI\nExperience with CSS and Tailwind\nExperience developing a component library and design systems, and using tools such as Storybook\nExperience working with frameworks such as TanStack/React Query, Zustand, and Redux\nBenefits:\nCompetitive compensation and equity\n401k\nHealthcare (Silver PPO Medical, Vision, Dental)\nLunch and snacks at the office\nWe encourage you to apply even if you don't fully meet all the listed requirements; we value potential and diverse perspectives, and your unique skills could be a great asset to our team.\nCompensation Range: $175K - $275K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Electronics Test Engineer",
    "company_name": "Northwood Space",
    "company_stage": "Seed",
    "location": "Los Angeles, CA, California, USA, Torrance, CA",
    "industry": "American Dynamism",
    "category": "Engineering",
    "experience_level": "Mid",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$115,000 - $145,000",
    "description_url": "https://jobs.ashbyhq.com/NorthwoodSpace/e153b809-8535-4d9d-b48c-c25acdeadae7",
    "required_skills": [
      "USB",
      "Test Equipment",
      "Instrumentation",
      "Mixed Signal",
      "Sequencing",
      "Space Technology",
      "Quality Assurance",
      "Power Supplies",
      "Network Analyzer",
      "Department of State"
    ],
    "employee_count": "10-100 employees",
    "full_description": "Electronics Test Engineer @ northwoodspace\nYou need to enable JavaScript to run this app.\nElectronics Test Engineer\nLocation\nTorrance, CA\nEmployment Type\nFull time\nDepartment\nElectrical\nCompensation\nMid-Level\n$115K – $145K • Offers Equity\nCompensation at Northwood Space is based on role, level, location, and alignment with market data. Individual base pay is determined on a case-by-case basis and may vary depending on job-related skills, education, experience, and technical expertise. In addition to base salary, Northwood Space offers long-term incentives such as company stock options and discretionary performance bonuses. Benefits include equity, comprehensive health care, flexible vacation, retirement savings plans, and opportunities for professional development.\nOverview\nApplication\nAbout Northwood:\nNorthwood is a modern space infrastructure company focused on connecting space and Earth. The world runs on space. Space will run on Northwood. Our global ground network ensures that missions ranging from national security, to global connectivity, to disaster response can unlock their full potential and operate every day without fail.\nNorthwood is looking for an Electronics Test Engineer to build the test systems that ensure our hardware performs reliably from early prototypes through high-rate production. You’ll own test development end-to-end: defining strategies, designing fixtures and harnessing, building automation frameworks, and delivering scalable test infrastructure for both development and manufacturing. This is a highly hands-on role that sits at the intersection of electronics, software, and systems integration — ideal for someone who enjoys turning ambiguous problems into robust, repeatable test capabilities that help ship world-class systems.\nResponsibilities\n:\nLead integrated test development from concept through production, including test strategy, requirements, and execution plans\nDesign hardware, wiring, and electrical systems to support electrical and RF testing for both production and development needs (fixtures, harnesses, interfaces, rack integration)\nDevelop modular and reusable test automation software, including frameworks, drivers, and tooling in Linux environments using Python / Rust / C++\nOwn test maintainability and reliability across the lifecycle — defining calibration, upkeep, debugging, and continuous improvement of test assets\nCreate device and subsystem simulators for hardware-in-the-loop (HITL) and automated integration testing\nSupport environmental and qualification testing (thermal, vibration, shock), including defining instrumentation and test procedures where needed\nBasic Qualifications:\nBachelor’s degree in Electrical Engineering or related field\nStrong programming abilities (Python, C++, Rust), and comfort developing in a Linux-based environment\nHands-on experience with electrical test equipment such as power supplies, DC loads, oscilloscopes, logic analyzers, and network analyzers\nPreferred Experience and Skills\n:\nExperience root-causing issues in integrated electronics (mixed-signal, digital, RF-adjacent systems)\nFamiliarity with MIL-STD-810 test methods, including vibration, shock, and thermal testing\nExperience designing test racks / ATE systems (PXI, USB/LXI instrumentation, custom interfaces) and scaling them into production\nExperience writing reusable test software patterns (hardware abstraction layers, driver libraries, test sequencing frameworks)\nComfort working at the boundary between HW + SW: firmware bring-up, control interfaces (I2C/SPI/UART), fault injection, telemetry capture\nAdditional Information:\nTo conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR) you must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State.\nNorthwood is an Equal Opportunity Employer; employment with Northwood is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.\nCompensation Range: $115K - $145K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Sr. Recruiting Operations Specialist",
    "company_name": "Mysten Labs",
    "company_stage": "Growth",
    "location": "United States, USA (Remote)",
    "industry": "Crypto/Web3",
    "category": "HR/People",
    "experience_level": "Senior",
    "remote_option": true,
    "is_hybrid": false,
    "salary_range": "$148,000 - $185,000",
    "description_url": "https://jobs.ashbyhq.com/mystenlabs/dbff6d5e-0fc7-48c8-a689-b648061d9041",
    "required_skills": [
      "Infrastructure",
      "Scheduling",
      "Human Resources",
      "Integrated Circuit Design",
      "Blockchain",
      "Applicant Tracking Systems",
      "Interviews",
      "Data Driven"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Sr. Recruiting Operations Specialist @ Mysten Labs\nYou need to enable JavaScript to run this app.\nMysten Labs\nSr. Recruiting Operations Specialist\nLocation\nUSA (Remote)\nEmployment Type\nFull time\nLocation Type\nRemote\nDepartment\nRecruiting\nCompensation\n$148K – $185K\nThe US base salary range for this full-time position is\n$\n148,000 - $185,000. Our salary ranges are determined by role and level, but not location (within the US). The salary range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within this range, individual pay is determined by additional factors including job-related skills, experience, and relevant education or training.\nOur total compensation package also includes: tokens + equity compensation, benefits, and eligibility to participate in the annual equity and token refresh grant programs.\nOur benefits package for US employees also includes:\n🩺  Comprehensive health insurance including medical, dental, and vision covered for you and your dependents; including Tax Savings Benefits such as HSAs and FSAs.\n🍼 18 weeks of paid Parental Leave\n👥 Complimentary access to wellbeing programs, such as family planning support, gender affirming care, and hormone replacement therapy as well as physical fitness/nutrition apps. We also provide mental health support and counseling and EAP (Employee Assistance Program) for financial/legal assistance, home life referrals, and more\n⛑️ Short Term and Long Term Disability coverage as well as Life Insurance and Accident Insurance, and other coverage options.\n🧳 Traveler Insurance\n📈 401(k)\n😎 Complimentary privacy protection service\n✨ Wellness stipend\n🌴 Flexible paid time off and 11 paid holidays per year\n✈️ Team offsites and annual all-company retreat\nOverview\nApplication\nMysten Labs believes that decentralized and open protocols are the bedrock of the internet of value. This is why at Mysten Labs, we are creating foundational infrastructure to accelerate the adoption of decentralized protocols based on blockchain technologies.\nThe Role\nAs a Recruiting Operations Specialist at Mysten Labs, you will be a highly impactful contributor responsible for building, running, and continuously improving the operational foundation of our recruiting function.\nThis role goes well beyond interview scheduling. You’ll own recruiting workflows, systems, data, and tooling, while remaining hands-on in execution. You will partner closely with recruiters, hiring managers, and People Ops to ensure hiring is efficient, data-driven, and delivers an exceptional candidate experience as Mysten scales.\nThis role is ideal for someone who enjoys being deep in the details, thrives in ambiguity, and wants to grow as a senior IC in recruiting and people operations.\nWhat You’ll Do\nCandidate Experience & Journey Ownership\nOwn the end-to-end candidate experience across all stages of the hiring lifecycle, from the first interview to the offer stages\nDesign and continuously improve candidate-facing touchpoints including interview scheduling, prep materials, communications, and follow-ups\nAct as the single-threaded IC owner for candidate experience standards, ensuring consistency, clarity, and professionalism across teams and roles\nIdentify friction points in the candidate journey and implement process or tooling improvements to reduce drop-off and improve satisfaction\nCoordination & Execution (High-Complexity)\nIndependently manage high-volume and high-complexity interview coordination, including multi-panel, cross-functional, and executive interviews across time zones\nAnticipate scheduling challenges and proactively solve for interviewer availability, candidate constraints, and timeline risks\nManage candidate logistics such as NDAs, interview confirmations, travel coordination (when applicable), and real-time issue resolution\nEnsure interviews run smoothly and on time, acting as a reliable point of contact for both candidates and internal teams\nMeasurement & Feedback Loops\nImplement mechanisms to measure candidate experience (e.g., surveys, response times, drop-off analysis)\nTrack and analyze candidate experience metrics in partnership with recruiters\nUse insights and feedback to inform process improvements and candidate communication standards\nEnsure consistency and high quality across recruiting processes while adapting to different teams’ needs\nATS Ownership & Systems (Ashby)\nServe as the primary IC owner and expert for Ashby\nConfigure and maintain pipelines, interview plans, scorecards, automations, and reporting\nPartner with recruiters to optimize workflows and ensure data accuracy and system hygiene\nTroubleshoot ATS issues and act as the first line of support for the recruiting team\nData, Reporting & Insights\nProduce regular recruiting reports and dashboards (time-to-hire, funnel conversion, interviewer load, etc.)\nMaintain clean and reliable recruiting data\nSurface insights that help recruiters and leaders make better hiring decisions\nSupport ad-hoc analysis requests related to hiring performance and planning\nAI & Automation in Recruiting\nHelp implement and manage AI-powered tools and automations across recruiting workflows\nExperiment with tools that improve scheduling efficiency, candidate experience, and recruiter productivity\nPartner with recruiters to responsibly incorporate AI into daily workflows\nCross-Functional & Project Work\nContribute as a hands-on IC to recruiting projects such as onboarding improvements, documentation, and tooling rollouts\nPartner cross-functionally with People Ops, Finance, Legal, and leadership assistants on hiring workflows\nWhat You’ll Have\n4+ years of experience in recruiting coordination, recruiting operations, HR operations, or a similar role\nStrong interest in Recruiting Operations as a long-term career path\nHighly organized with exceptional attention to detail\nComfortable managing multiple priorities in a fast-moving environment\nStrong systems and process mindset with the ability to execute independently\nExperience working with an ATS (Ashby strongly preferred)\nAnalytical and comfortable working with recruiting data and reports\nClear, professional communicator (written and verbal)\nCurious about technology and excited by AI and automation in recruiting\nCollaborative, approachable, and service-oriented\nEmployment is contingent upon the successful completion of a background check, which may include verification of employment history, education credentials, criminal history, and other relevant information.\nRegarding the recent rash of technology job scams: Be aware that emails from genuine Mysten Labs group recruiters will always come from the @\nmystenlabs.com\ndomain or related subdomains (e.g.,\nmystenlabs.com/careers\n). Remember: you can always verify positions on our job boards at\nwww.mystenlabs.com/careers\n.\nTo support an efficient and fair hiring process, we may use technology-assisted tools, including artificial intelligence (AI), to help identify and evaluate candidates. All hiring decisions are ultimately made by human reviewers.\nOur team is remote first and we are hiring across the world. Here at Mysten Labs, you’ll be joining a world-class team with tremendous growth potential as we bring the next billion users to web3. We raised a $300M Series B round from top Silicon Valley led venture funds like Jump Crypto, Andreessen Horowitz (a16z), Binance Labs, Redpoint, Lightspeed, Coinbase Ventures, Electric Capital, Standard Crypto, NFX, Slow Ventures, Scribble Ventures, Samsung Next, Lux Capital, among other investment firms and strategic partners. Come join us and build the future of web3!\nCompensation Range: $148K - $185K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Software Engineer, Mobile",
    "company_name": "Kalshi",
    "company_stage": "Series A",
    "location": "New York City, New York, United States, New York Office",
    "industry": "Fintech",
    "category": "Engineering",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$180,000 - $250,000",
    "description_url": "https://jobs.ashbyhq.com/kalshi/35ff02ff-c0b0-4560-96c8-4a6a9e4db9f2",
    "required_skills": [
      "React.js",
      "Market Data",
      "Artificial Intelligence",
      "Trading Systems",
      "User Experience",
      "Quality Assurance",
      "Mobile Programming",
      "React Native",
      "Mobile"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Software Engineer, Mobile @ Kalshi\nYou need to enable JavaScript to run this app.\nSoftware Engineer, Mobile\nLocation\nNew York Office\nEmployment Type\nFull time\nLocation Type\nOn-site\nDepartment\nEngineering\nOverview\nApplication\nKalshi is defining a new category\nKalshi has defined a new category: prediction markets. Kalshi allows people to trade on the outcome of any events and turn any question about the future into a financial asset. Kalshi fought for years and legalized prediction markets in the US for the first time in history, is currently the fastest growing financial market in America, and has thousands of markets across politics, economics, financials, weather, tech, AI, culture and more.\nWe believe prediction markets have the potential to be the largest financial market because they turn anything into a financial position.\nOur vision: well… build the largest financial market on the planet.\nOur mission: bring more truth to the world through the power of markets.\nOur culture is simple: we hire really talented people, work really hard, and enjoy the climb. We are looking for ambitious and exceptional people to join our (relatively small) team to help us build the next generation of financial markets.\nRole Roadmap\nWe’re looking for a highly execution-oriented Mobile Engineer to own and scale Kalshi’s mobile application experience. This role is responsible for building the core trading and user-facing platform on mobile, with clear ownership over feature delivery, performance, and long-term technical direction.\nYou’ll be a primary operator on our mobile stack — designing, building, shipping, and owning production-grade mobile features end to end. As Kalshi scales, this role will grow in scope and impact, with increasing influence over architecture, reliability, and team development. Success in this role comes from strong technical judgment, comfort owning complex systems, and a bias toward shipping high-quality user experiences quickly\nWhat You'll Do\nOwn the development and evolution of Kalshi’s mobile application, with responsibility for quality, performance, and user experience\nDesign, build, test, and ship customer-facing mobile features end to end\nBuild and maintain a production-grade mobile application using Flutter, including core platform features like notifications and biometric authentication\nCollaborate closely with product and design partners to translate business and user needs into thoughtful technical solutions\nArchitect user interfaces, manage application state, and integrate cleanly with backend APIs\nMake and execute on software architecture decisions that support long-term scalability and reliability\nOperate with a strong sense of ownership over deployment, maintenance, and ongoing improvement of the mobile app\nMentor and support other mobile engineers as the team grows, helping establish strong engineering practices and standards\nWhat You Bring\n5+ years of industry experience building customer-facing software\nStrong mastery of Flutter and experience shipping production-grade mobile applications\nHands-on experience with core mobile features such as push notifications, biometric authentication, and device-level integrations\nStrong technical fundamentals in application architecture, state management, and API-driven systems\nAbility to own work end to end, from design and implementation through testing and deployment\nComfort operating in a fast-paced, scaling environment with evolving requirements\nStrong collaboration skills and a product-oriented mindset\nA bias toward execution, code quality, and delivering exceptional user experiences\nBonus:\nExperience with React or React Native\nNYC Pay Transparency Disclosure\nBase Salary Range:\n$180,000–$250,000\nThis range reflects current market data for this role. Kalshi has minimal hierarchy and broad variance in experience levels within each title; if your compensation expectations exceed this range, we encourage you to reach out — we’re always happy to discuss.\nOur Culture\nMeritocracy is at our core, and we value people who take ownership and figure (usually hard) things out. We dream big. We love our craft deeply and are proud of what we put out in the world. We are committed to our vision of building something big… but also useful: a product that brings more truth through the power of markets.\nKalshians are Kalshi’s most important asset: we pick Kalshians carefully, so we trust them fully on day 1.\nCommitment to Equal Opportunity\nKalshi is committed to creating a culture of inclusion and belonging, and we are proud to be an equal opportunity employer. We believe it is our collective responsibility to uphold these values and encourage candidates from all backgrounds to join us in our mission. All qualified applicants will be treated with respect and receive equal consideration for employment without regard to race, color, creed, religion, sex, gender identity, sexual orientation, national origin, disability, uniform service, veteran status, age, or any other protected characteristic per federal, state, or local law. If you are passionate about what you do and want to use your talents to support our mission and values, we’d love to hear from you.\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Partner Manager, Consulting Partnerships",
    "company_name": "Harvey",
    "company_stage": "Growth",
    "location": "New York, New York, USA, San Francisco, California, USA, New York, San Francisco",
    "industry": "AI",
    "category": "Sales",
    "experience_level": "Senior",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$170,000 - $230,000",
    "description_url": "https://jobs.ashbyhq.com/harvey/9bee1e51-801a-42d1-8d82-f63942c2ff0e",
    "required_skills": [
      "Change Management",
      "Artificial Intelligence",
      "System Integrators",
      "Management Consulting",
      "Dynamic Systems",
      "Big 4",
      "Professional Services",
      "Strategic Partnerships"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Partner Manager, Consulting Partnerships @ Harvey\nYou need to enable JavaScript to run this app.\nPartner Manager, Consulting Partnerships\nLocation\nNew York, San Francisco\nEmployment Type\nFull time\nLocation Type\nHybrid\nDepartment\nPartnerships\nCompensation\n$170K – $230K • Offers Equity • Offers Commission • 70/30 Split\nAdditionally, this role is eligible to participate in our equity plan and benefits program. Benefits include, but not limited to: Comprehensive health, dental and vision coverage, retirement benefits (401k match up to 4%), and flexible PTO.\nOverview\nApplication\nWhy Harvey\nAt Harvey, we’re transforming how legal and professional services operate — not incrementally, but end-to-end. By combining frontier agentic AI, an enterprise-grade platform, and deep domain expertise, we’re reshaping how critical knowledge work gets done for decades to come.\nThis is a rare chance to help build a generational company at a true inflection point. With 700+ customers in 58+ countries, strong product-market fit, and world-class investor support, we’re scaling fast and defining a new category in real time. The work is ambitious, the bar is high, and the opportunity for growth — personal, professional, and financial — is unmatched.\nOur team is sharp, motivated, and deeply committed to the mission. We move fast, operate with intensity, and take real ownership of the problems we tackle — from early thinking to long-term outcomes. We stay close to our customers — from leadership to engineers — and work together to solve real problems with urgency and care. If you thrive in ambiguity, push for excellence, and want to help shape the future of work alongside others who raise the bar, we invite you to build with us.\nAt Harvey, the future of professional services is being written today — and we’re just getting started.\nRole Overview\nWe are hiring a legal expert and business athlete to drive change management at our most strategic customer accounts. This role will define and execute change management programs that accelerate legal AI adoption, and also work closely with our strategy consulting partners to ensure clients successfully navigate their legal transformation journeys.\nWhat You'll Do\nDesign and implement change management programs at strategic customer accounts, utilizing legal and AI subject matter expertise to address adoption challenges and drive organizational transformation.\nManage relationships with strategy consulting partners who support Harvey clients on legal AI transformation initiatives, ensuring alignment on methodologies, deliverables, and client outcomes.\nDefine the change management playbook and best practices based on insights from customer implementations, partner engagements, and your legal industry experience.\nPartner closely with Customer Success, Sales, Solution Engineering, and Product teams to identify change management needs and ensure seamless execution across the customer lifecycle.\nStand up new consulting partner programs and enablement initiatives, including partner training on Harvey's platform, joint go-to-market strategies, and co-delivery models.\nTrack and measure the effectiveness of change management interventions and partner engagements, driving continuous improvement and scaling successful approaches.\nIdentify gaps in change management strategy and partner ecosystem, developing solutions that accelerate client value realization and deepen strategic relationships.\nWhat You Have\n5-8+ years of experience in management consulting, change management, or strategy roles at top-tier firms (e.g., MBB, Big 4, or boutique strategy consultancies).\nProven track record of designing and leading large-scale organizational change and transformation programs, ideally within professional services, legal, or enterprise technology contexts.\nStrong executive presence with experience managing complex partner ecosystems, including consulting firms, system integrators, or advisory organizations.\nDeep expertise in change management methodologies with the ability to adapt frameworks to client-specific needs.\nExperience working with or in the legal industry is a strong plus—understanding of law firm operations, legal department dynamics, or legal technology adoption challenges.\nExceptional stakeholder management and influencing skills—can build trust with C-suite executives, drive alignment across matrixed organizations, and navigate organizational politics with diplomacy.\nStrong analytical and problem-solving capabilities with a bias toward action and results.\nCompensation\n$170,000 - $230,000 USD OTE with a 70/30 Split\nPlease find our CA applicant privacy notice\nhere\n.\n#LI-LS1\nHarvey is an equal opportunity employer and does not discriminate on the basis of race, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition, or any other basis protected by law.\nWe are committed to providing reasonable accommodations to applicants with disabilities, and requests can be made by emailing\naccommodations@harvey.ai\nCompensation Range: $170K - $230K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  },
  {
    "title": "Executive Assistant",
    "company_name": "Envoy",
    "company_stage": "Growth",
    "location": "San Francisco, California, United States, San Francisco, CA",
    "industry": "Enterprise",
    "category": "G&A",
    "experience_level": "Mid",
    "remote_option": false,
    "is_hybrid": false,
    "salary_range": "$132,000 - $150,000",
    "description_url": "https://jobs.ashbyhq.com/envoy/f2036cb6-5c26-4609-87a4-78d08322b44d",
    "required_skills": [
      "Workflow Scheduling",
      "Compliance",
      "Artificial Intelligence",
      "Jira",
      "Finance",
      "Mechanics",
      "Follow through",
      "Asana"
    ],
    "employee_count": "100-1000 employees",
    "full_description": "Executive Assistant @ Envoy\nYou need to enable JavaScript to run this app.\nExecutive Assistant\nLocation\nSan Francisco, CA\nEmployment Type\nFull time\nLocation Type\nOn-site\nDepartment\nGeneral & Administrative\nCompensation\nSan Francisco Bay Area $132K – $150K\nEnvoy's compensation package includes a market-competitive salary, equity for all full-time roles, and excellent benefits.  Final offers may vary within the provided range, depending on experience, expertise, and other factors.\nOverview\nApplication\nEnvoy builds workspace management technology that makes it simple to run secure, compliant, and connected workplaces across every location. Over 16,000 workplaces and properties around the world rely on Envoy to create great experiences for employees and visitors while meeting safety, security, and compliance needs at scale. From corporate headquarters and labs to manufacturing sites, Envoy powers the places where people work best together.\nLearn more at\nenvoy.com\nAbout the role\nWe are looking for an exceptional Executive Assistant to support our CFO/COO and the Head of People. This role is central to executive effectiveness: you’ll manage complex calendars, drive meeting and communication rigor, and run the operating mechanics behind cross-functional initiatives spanning Finance/Operations and People. You will be a trusted partner who anticipates needs, maintains high standards for follow-through, and uses modern tooling—including AI—to improve planning, documentation, and execution.\nThis is an in-office position that requires 5 days a week in our San Francisco HQ\nYou will\nOwn complex calendar management for two executives with a prioritization and tradeoff mindset; proactively protect focus time and align schedules to business-critical goals\nPrepare agendas, briefing materials, and decision-ready meeting packets; capture decisions, actions, owners, and deadlines to ensure follow-through\nManage executive communications and stakeholder coordination across Finance/Operations and People (internal and external)\nTranslate exec priorities into structured plans (milestones, owners, dependencies, risks); maintain project dashboards and operating cadences\nDrive execution on cross-functional initiatives (planning cycles, reviews, offsites, launches) by coordinating pre-work, exec readiness, stakeholder alignment, and post-meeting/action follow-ups\nImprove operating systems (meeting hygiene, documentation standards, decision logs) and continuously refine workflows using automation/AI where appropriate\nOwn operational execution for key People programs and events, treating them as launches (planning, communications, logistics, measurement, retrospectives)\nSupport team events, offsites, and onsite leadership visits; welcome executive visitors as needed\nPartner with Workplace/IT as needed to ensure smooth onsite operations for exec meetings and events\nSupport special projects on an as-needed basis\nYou are\nAn experienced Executive Assistant who has worked in an administrative role for 3-5 years, ideally in a high-growth or fast-changing environment; experience supporting multiple executives is a plus\nStrong project/program management skills: can run timelines, risks, dependencies, and stakeholder communications without dropping details\nExcellent written communication (clear, concise, decision-oriented) and strong verbal presence with senior stakeholders\nHighly proficient with Google Workspace; comfortable building lightweight systems in tools like Asana/Jira/Notion/Sheets (or equivalents)\nDemonstrated ability to use AI tools responsibly (e.g., summarization, drafting, meeting prep, workflow automation) while maintaining confidentiality and accuracy\nCalm under pressure, highly organized, and decisive about priorities; able to manage both proactive planning and reactive needs\nAvailable for occasional flexibility outside standard hours for executive/board-related needs\nYou’ll get\nA high degree of trust in your ideas and execution\nAn opportunity to partner and collaborate with other talented people\nThe ability to make an immediate impact in helping customers create a great workplace experience\nSupport for your personal and professional growth\nBy applying for this position, you acknowledge that you have fully read and understand the job requirements and received the Envoy Privacy Notice for applicants, which is linked\nhere\n. Completing this application requires you to provide personal data, such as your name and contact information, which is mandatory for Envoy to process your application. Envoy is an EEO Employer and does not discriminate on the basis of any characteristic protected by local, state or federal law.\nCompensation Range: $132K - $150K\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nPowered by\nAshby\nPrivacy Policy\nSecurity\nVulnerability Disclosure"
  }
]